{"jobs": [{"WhatYouWillDo": " The Information Sciences group (CCS‐3) of Los Alamos National Laboratory (LANL) has an opening for outstanding postdoctoral research associates in the area of combinatorial optimization. The selected candidates will be given the opportunity to work with one of the only four commercially available quantum annealing computers worldwide, D-Wave 2X, with more than 1000 qubits. Typical tasks involve formulating an NP-hard optimization problem as a quadratic unconstraint binary optimization (QUBO) problem and designing methods for improving quantum annealing scalability and accuracy.Quantum annealing is considered as one of the promising exascale and “beyond Moore’s law” computing technologies. Quantum annealers such as LANL’s D-Wave 2X are designed to natively propose solutions for optimization problems that are known to be challenging for classical computers. Preliminary knowledge about quantum physics or quantum computing is not a requirement for this position, but strong combinatorial algorithm design and implementation skills are essential.", "OrganizationName": "CCS-3/nformation Sciences", "JobTitle": "Optimization Algorithms for Post-Moore-Era Supercomputing Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1289119428&retainAM=N&addBreadCrumb=RP&p_svid=58529&p_spid=2679313&oapc=6&oas=syq_OMSWA5kQAi01X3PiIw..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58529"}, {"WhatYouWillDo": " The Plasma Physics Team with the CCS-2 group (Computational Physics and Methods Group, Computer and Computational Sciences Division) at Los Alamos National Laboratory is seeking candidates for postdoctoral positions in multi-scale modeling of dense plasmas. The successful candidate will:Work on a team to develop new computational models that span the physics of cool dense matter to hot dense matter, working as a team to incorporate results into practically useful reduced order models.Perform simulations in the cool dense matter regime using ab initio molecular dynamics (AIMD) methods connecting to kinetic theory models or fluid closures. Work at integrating models across MD, Kinetic Theory and Fluid closure models Publish in the highest-quality journals and present at national and international conferences. Be the expert on warm dense matter as part of a multidisciplinary team.Connect research directly to experiments, such as those at NIF and the Linac Coherent Light Source (LCLS) at SLAC. ", "OrganizationName": "CCS-2/Computational Physics And Methods", "JobTitle": "Multi-Scale Modeling in Warm-Dense Matter Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1289119428&retainAM=N&addBreadCrumb=RP&p_svid=58120&p_spid=2662291&oapc=9&oas=sVS3Ef_Fr5b73IY1_wl7oA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58120"}, {"WhatYouWillDo": "Los Alamos National Laboratory is a multidisciplinary research institution engaged in scienceand engineering on behalf of national security. The climate modeling effort at LANL, in part,develops and uses advanced multi-scale models for the study of Earth system processes. Thistwo year position is available immediately. The postdoc researcher will work in a Department of Energy (DOE) program that supportsfundamental, interdisciplinary research to achieve a predictive understanding of climate.Exploiting the capabilities of DOE’s High Performance Computing (HPC) systems in order toaccelerate advances in climate science is a priority. Sophisticated, architecture-aware, variable-resolution dynamical cores developed under thisproject permit direct numerical studies of atmospheric phenomena that are poorly resolved inthe current generation of climate models. Such processes include effects due to steeptopography, convection and cloud processes, gravity waves, frontogenesis, and others. Theresearcher will focus on investigating and characterising linkages between such processes andthe climate system. For example, the researcher will conduct variable-resolution,non-hydrostatic simulations in order to better capture precipitation distribution in developingfronts, and study the effects of such more-accurate representation of local precipitation onseasonal and regional precipitation biases---biases that plague the current generation of climatemodels.", "OrganizationName": "CCS-2/Computational Physics And Methods", "JobTitle": "Geophysical Fluid Dynamics and Atmospheric Dynamics Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1289119428&retainAM=N&addBreadCrumb=RP&p_svid=57880&p_spid=2651291&oapc=12&oas=dOQcuBfB_n3koTQy0y-Axw..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC57880"}, {"WhatYouWillDo": " The Applied Computer Science group (CCS-7) is the Laboratory’s vanguard research organization for scientific applications at extreme scale. The four focus areas of the group are (1) applications, algorithms, and hardware co-design; (2) performance optimization and transition of scientific applications to future architectures; (3) programming models, runtime systems and tools; and (4) data science and visualization at scale. Projects typically involve collaborations inside and outside of the Laboratory, in line with the group’s commitment to engage with theoretical, experimental, and computer-systems scientists to develop integrated, cross-disciplinary solutions to challenges posed by next-generation extreme-scale computing. Billion-way parallelism, deep memory and storage hierarchies, and heterogeneous computing are forcing us to rethink how we enable applications at extreme scale and we are one of the few groups in the world focusing on solutions to these issues. CCS-7 invites programmers to apply for a position of Scientist 2/3 in our group and strengthen our efforts to provide assistance to science application code teams that are preparing for emerging high-performance system architectures. The successful candidate is expected to be a self-starter, taking initial direction and requirements from technical project leads, and to work as part of a collaborative, multidisciplinary team to support the science applications in the high performance computing community.   We are looking for candidates with either a computer science background and a computational science interest, or a computational science background with an interest of computer science.  The ideal candidate will have a demonstrated track record of contributions to large project.  In addition, demonstrated programming-for-fun through contributions to open source projects or other projects away from work is highly valued.  Knowledge of parallel programming either through GPU programming (CUDA/OpenCL/etc.), threads (OpenMP/Posix/etc.), or MPI is required. This position will be filled at either the Scientist 2/3 level, depending on the skills of the selected candidate.  Additional job responsibilities (outlined below) will be assigned if the candidate is hired at the higher level. Scientist 2 ($86,000-$141,800)The successful candidate will be required to:Design and implement interfaces for separating the physics from the underlying hardware using industry standard software engineering practices Work both independently and collaboratively with other members of the team after receiving initial direction and requirements from technical project leadsDeliver based on provided direction, for example, provide reference implementations for techniques described in a research paper or a technical report, or improve the efficiency / performance of a section of code within a larger applicationConduct a literature search to find prior research related to an idea Work with team members to make modifications and additions to existing code and methodsWork with team members to document, design and implement new ideas and approaches for newer architectures and improve those for existing onesScientist 3 ($94,500-$157,800)In addition to the duties of a Scientist 2, the successful candidate will be required to:Contribute to proposals for research and implementation of new methods, frameworks and programming models in support of scientific application developmentInteract with people from other teams, groups, divisions, directorates, and programs to create collaborationsWork with limited direction, for example, execute work based on a fragment of an idea or a half-formed idea and carry it to completionMentor junior scientists and studentsPresent the results of research at conferences, workshops, and meetings Represent LANL and the DOE at workshops and meetings", "OrganizationName": "CCS-7/Applied Computer Science", "JobTitle": "Applied Computer Science Group Programmers (Scientist 2/3)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1289119428&retainAM=N&addBreadCrumb=RP&p_svid=53598&p_spid=2424287&oapc=15&oas=sEKmE1AjmpQBQ1-zavrEmA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC53598"}]}