{"jobs": {"HighPerformanceComputing": [{"Location": "Los Alamos, NM, US", "JobTitle": "Scientist 2/3", "OrganizationName": "T-1/ Physics & Chemistry Of MaterialsWhat You Will This position will be filled at either the Scientist 2/3 level, depending on the skills of the selected candidate.  Additional job responsibilities (outlined below) will be assigned if the candidate is hired at the higher level. The candidate will be expected to perform outstanding research in the area of computational physics and chemistry on problems concerning properties and dynamics of materials under extreme conditions. T-1 staff performs research and development in these areas using a wide range of techniques, spanning multiple length scales, from the atomic to the continuum.  Scientist 2 ($84,300 - $139,000)The successful candidate will be required to:Lead independent researchWork in inter-disciplinary teams, encompassing theorists and experimentalists, to develop new theoretical and computational tools for prediction of materials properties under extreme conditionsSubmit grant proposals for competitive funding calls as appropriateCommunicate research findings via journal articles, internal and external reports, and presentationsRecruit and mentor post-doctoral fellows and graduate students Scientist Level 3 ($92,600 - $154,600)In addition to the duties outlined above, the Scientist 3 will be required to:Lead technical decision making and direction at the project or team levelCoordinate the work of others and serve as a role model for creative technical leadership within the team. What You NeedMinimum Job Requirements:Demonstrated knowledge of and relevant experience in one or more of the research areas described abovePhD in Physics, Chemistry, or Materials Science or a closely related discipline.Strong background in computer programming using modern computing languagesExperience in running large-scale computational physics, chemistry, or materials science codes based on atomistic quantum-chemical approaches and/or molecular dynamics using classical force-fields and/or continuum modelsAdditional Job Requirements for (higher level title):In addition to the Job Requirements outlined above, qualification at the Scientist 3 level requires:Experience in development and analysis of models that describe materials under extreme conditions.Demonstrated experience and success in proposal writing, project management and mentoring.Desired Skills: Background in thermodynamics and understanding of materials under extreme conditions. Prediction of material properties under such conditions using modern computational approaches, such as density functional theory.Experience working with high-performance computing systems.Experience in multi-scale type simulations, bridging two or more time and/or length scalesAbility to obtain a Q clearance Education Required:Lower Level: PhD in Chemistry, Physics, or Material Science or a closely related discipline with research areas related to calculation of materials properties Higher Level Education Required:  Ph. D in Chemistry, Physics, or Material Science or a closely related discipline with research areas related to calculation of materials propertiesNotes to Applicants: Please include a curriculum vitae, names of three references, and a cover letter detailing qualifications and research interests that are specific to the job requirements outlined in this job advertisement with your application.Additional Details:Clearance: Q (Position will be cleared to this level).  Applicants selected will be subject to a Federal background investigation and must meet eligibility requirements* for access to classified matter. *Eligibility requirements:  To obtain a clearance, an individual must be at least 18 years of age; U.S. citizenship is required except in very limited circumstances. See DOE Order 472.2 for additional information.New-Employment Drug Test: The Laboratory requires successful applicants to complete a new-employment drug test and maintains a substance abuse policy that includes random drug testing.Term position: Regular-status Laboratory employees applying for term-status positions may retain regular status with approval of the cognizant Principle Associate Director.Equal Opportunity: Los Alamos National Laboratory is an equal opportunity employer and supports a diverse and inclusive workforce. All employment practices are based on qualification and merit, without regards to race, color, national origin, ancestry, religion, age, sex, gender identity, sexual orientation or preference, marital status or spousal affiliation, physical or mental disability, medical conditions, pregnancy, status as a protected veteran, genetic information, or citizenship within the limits imposed by federal laws and regulations.  The Laboratory is also committed to making our workplace accessible to individuals with disabilities and will provide reasonable accommodations, upon request, for individuals to participate in the application and hiring process. To request such an accommodation, please send an email to applyhelp@lanl.gov or call 1-505-665-4444 option 1.Where You Will Work Located in northern New Mexico, Los Alamos National Laboratory (LANL) is a multidisciplinary research institution engaged in strategic science on behalf of national security.  LANL enhances national security by ensuring the safety and reliability of the U.S. nuclear stockpile, developing technologies to reduce threats from weapons of mass destruction, and solving problems related to energy, environment, infrastructure, health, and global security concerns.Appointment TypeTerm AppointmentTerm AppointmentMinimum SalaryMaximum Salary", "VacancyNumber": "IRC59565", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=59565&p_spid=2730309&oapc=6&oas=CBPcm7Aj6y5CSiODbTUAKg.."}, {"WhatYouWillDo": "This position will be filled at either the Scientist level 2 or 3, depending on the skills of the selected candidate.  Additional job responsibilities (outlined below) will be assigned if the candidate is hired at the higher level.Scientist 2 - ($86,000 - $141,800)The successful candidate will be required to:Assist in the resolution of issues with production weapons and institutional application codes running on HPC platformsAssist in the support and development of Open MPI and promoting its use in LANL applications.Assist with efforts to tune LANL HPC applications for better performance/throughputContribute to modernization of LANL applications to enable them to leverage next generation systems like Trinity, Sierra, and Crossroads which are planned to be Intel KNL and IBM/nVidia architectures as well as anticipate future architectures for these codesWhere appropriate contribute to technical journal papers, reports, presentations, and concept papers on applications usage of large simulation resources.Work hand in hand with production system administration in determining the most difficult problems involving applications running on HPC systemsDevelop excellent working relationships with application code teams, HPC tools and user support teams, and systems design, integration and production support teams, and infrastructure related teams.Represent LANL applications on HPC systems at internal venues.Scientist 3 - ($94,500 - $157,800)In addition to the duties outlined above, the Scientist 3 will be required to:Take the lead in resolving issues with production weapons and institutional application codes running on HPC platformsTake the lead in resolving issues with production HPC workflows running on HPC environmentsBe familiar with a subset of the LANL HPC applications code baseLead efforts to tune LANL HPC applications for better performance/throughputAssist the primary interface for applications when integrating new leading edge systems (both for LANL and LLNL systems) for LANL codesWhere appropriate author technical journal papers, reports, presentations, and concept papers on applications usage of large simulation resources.Represent LANL applications on HPC systems at internal and national venues.", "OrganizationName": "HPC-ENV/ HPC Environments", "JobTitle": "HPC Application Analyst (Scientist 2/3)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=59601&p_spid=2732305&oapc=9&oas=DzwUGUj6a2j-hVzN_0rQJA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59601"}, {"WhatYouWillDo": "This position is based in the Nuclear & Radiochemistry Counting Facility Team. The team is primarily responsible for the radiometric analysis of samples in support of national security and institutional programs, as well as research work in the areas of non-proliferation, radiochemistry, and nuclear physics.  The team maintains a large number of gamma spectrometry, alpha spectrometry, liquid scintillation and beta counting instrumentation and associated equipment, network, software, and databases. Primary responsibilities will include analysis of prepared samples using automated and manual systems. The candidate will be expected to perform routine calibrations of these systems and initiate and complete troubleshooting procedures. The understanding and use of various computing environments is necessary for data handling, manipulation and evaluation. Responsibilities will also include development of standard operating procedures, QA/QC implementation, consultation with other counting facility operators and users and report preparation.Duties and responsibilities include:Operation of automated spectroscopy systems from commercial vendors as well as those of unique construction.Ensuring that samples are analyzed promptly in accordance with priority and technical needs.Identification of issues or malfunctions of analytical instruments and initiation of troubleshooting and repairs.Analysis of results of radio-analytical measurements to ensure that instrumentation has operated correctly and that they meet the needs of the customer.Implementation of all aspects of the QA program and ensure that QC activities are conducted, reviewed, and acted upon.Thorough and accurate documentation of activities and results.", "OrganizationName": "C-NR / Nuclear & Radiochemistry", "JobTitle": "Countroom Research Technician (Research Tec 5)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=58650&p_spid=2692310&oapc=12&oas=YGXljrypsyoyB-GLLvYUVg..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58650"}, {"WhatYouWillDo": " The COSIM team seeks a postdoc to work on regional coastal climate modeling and analysis for application to climatological boundary conditions for farm-scale macroalgae modeling.  We particularly welcome research proposals for development of improved physical parameterizations corresponding to regional coastal modeling physics that impact biogeochemical processes.  With respect to simulation analyses we encourage research topics that lead to improved description and understanding of regional oceanic and BGC dynamics with a focus toward in-situ data processing and visualization.  The successful candidate will get to learn about and use regionally refined meshes for MPAS-O within the E3SM coupled modeling framework, find and use biogeochemistry (BGC) datasets for model tuning and calibration, incorporate additional model physics toward the improvement of the regional simulation (e.g., coupling a wave / sediment / sub-grid bathymetry model to MPAS-O) and evaluate model sensitivity.  Results from this work will be presented in conferences and published in peer-reviewed journals.  ", "OrganizationName": "T-3/Fluid Dynamics And Solid Mechanics", "JobTitle": "Postdoctoral Research Position for Regional Coastal Climate Modeling and Analyses", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=59604&p_spid=2732308&oapc=15&oas=fM8JqHPapIxUzjQwuJ4QwQ..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59604"}, {"WhatYouWillDo": "The Methods and Algorithms Group (XCP-4) in the Computational Physics (XCP) Division at Los Alamos National Laboratory has an opening for a scientist in theoretical and computational shock detonation physics.  The Methods and Algorithms Group (XCP-4) develops state-of-the art numerical methods for shock hydrodynamics and multimaterial flow in both Eulerian and Lagrangian framework and physics-based models for high explosive, turbulent reactive flow, and solid mechanics. Our work supports a variety of Laboratory missions, including stockpile stewardship, nonproliferation, threat reduction, and energy and environmental sciences. ", "OrganizationName": "XCP-4/Methods And Algorithms", "JobTitle": "Scientist 4/5", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=59487&p_spid=2721327&oapc=18&oas=RePQaY2oQ5HbIb2T7yD3kg..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59487"}, {"WhatYouWillDo": "Come join the best and brightest minds in the world at one of the most innovative and creative multidisciplinary research institutions engaged in strategic science on behalf of national security. The work we do at Los Alamos National Laboratory (LANL) matters to our country and the world. The Earth and Environmental Sciences Division is seeking to hire a Geologist to support and develop programmatic and R&D efforts.  This subject matter expert will work on multi-disciplinary projects to address critical national needs in the areas of nuclear energy, fossil energy, renewable energy, weapons effects, containment, nuclear detection monitoring, non-destructive evaluation, threat reduction, earthquake triggering, medical imaging, and climate science, and for the Comprehensive Test Ban Treaty.", "OrganizationName": "EES-DO/Earth and Environmental Sciences", "JobTitle": "Geologist Scientist (Scientist 3)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=59393&p_spid=2687357&oapc=21&oas=lQHEuvTUXAK9y4VrIR3SpQ..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59393"}, {"WhatYouWillDo": " The Plasma Theory and Application Group (XCP-6) applies theoretical and computational plasma physics to model and design novel ICF/HED experiments, theoretical models, and computational algorithms.  Areas of particular interest are: inertial confinement fusion; high energy density physics; turbulence and/or perturbed plasma flows; algorithm and model development for plasma and high energy density science. This research may lead to the design, fielding, and analysis of experiments at the Laboratory for Laser Energetics (LLE), and National Ignition Facility (NIF) lasers or on the Z machine pulsed power facility.  The successful candidate will be expected to continue fundamental or applied research in his/her areas of specialization as well as to support the national-security programs and mission of the Laboratory. ", "OrganizationName": "XCP-6/Plasma Theory And Applications", "JobTitle": "Plasma Physics Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=59394&p_spid=2687358&oapc=24&oas=0_Glx9_qP9hYAvbd4e0YTQ..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59394"}, {"WhatYouWillDo": " The Methods and Algorithms Group (XCP-4) develops state-of-the art numerical methods for shock hydrodynamics and multimaterial flow in both Eulerian and Lagrangian framework and physics-based models for high explosive, turbulent reactive flow, and solid mechanics. Our work supports a variety of Laboratory missions, including stockpile stewardship, nonproliferation, threat reduction, and energy and environmental sciences.  ", "OrganizationName": "XCP-4/Methods And AlgorithmsWhere You Will Work Our diverse workforce enjoys a collegial work environment focused on creative problem solving, where everyone’s opinions and ideas are valued. We are committed to work-life balance, as well as both personal and professional growth. We consider our creative and dedicated scientific professionals to be our greatest assets, and we take pride in cultivating their talents, supporting their efforts, and enabling their successes. We provide mentoring to help new staff build a solid technical and professional foundation, and to smoothly integrate into the culture of LANL. Compensation and Benefits ·         Multiple options for work schedules·         Exercise facility free for staff use·         Choice of comprehensive medical plans·         Paid sick time and disability insurance, maternity/paternity leave·         401k (100% match up to 6% + kicker)·         Fully vested in 401k on day one·         Relocation Assistance (if needed) Los Alamos, New Mexico enjoys excellent weather, clean air, and outstanding public schools. This is a safe, low-crime, family-oriented community with frequent concerts and events as well as quick travel to many top ski resorts, scenic hiking & biking trails, and mountain climbing. The short drive to work includes stunning views of rugged canyons and mesas as well as the Sangre de Cristo mountains. Many employees choose to live in the nearby state capital, Santa Fe, which is known for world-class restaurants, art galleries, and opera. ", "JobTitle": "High Explosives Modeling and Applications Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=59299&p_spid=2721320&oapc=27&oas=BdYFggrFSSZILKry3MopgA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59299"}, {"WhatYouWillDo": "  High performance computing is a powerful tool that when put into the hands of creative minds is helping humanity solve its hardest problems.  Supercomputers help us see structure in the chaos, find signals in the noise, and turn trillions of data points into answers to unlock radical innovation.  The High Performance Computing (HPC) Platforms Team provides vanguard system and runtime support for some of the largest and fastest supercomputers in the world, including multi-petaop systems (e.g., the recently deployed 40 Peta operations per second Trinity Supercomputer). Troubleshooters and problem-solvers at heart, the HPC Platforms Team seeks highly motivated, productive, inquisitive, and multi-talented candidates who are equally comfortable working independently as well as part of a team.  The successful applicant will acquire the skills needed to take a leading role in working on all aspects of LANL’s HPC cluster administration.  A broad range of expertise and background is desired in the team, and there are multiple projects that a successful candidate can pursue within the production and research disciplines of the team.  There are frequent opportunities for collaborative work with scientists and staff within the group (for instance with scientists designing and operating our high-speed networks or data storage infrastructure) or with scientists from other groups, including close collaborative research opportunities with LANL’s Ultrascale Systems Research Center (USRC), to help drive cutting edge advances.This role requires strong communication skills, as well as comprehensive troubleshooting and analytical skills.  Team member duties include: system deployment, configuration, and full system administration of LANL’s world-class compute clusters; evaluating and testing new technology and solutions; diagnosing, solving, and implementing solutions for various system operational problems; system administration of HPC network infrastructure in support of compute clusters; diagnosing, solving, and implementing solutions for various system operational problems; system software management and maintenance, including security posture maintenance; tuning operating systems to increase performance and reliability of services; developing tools to support automation, optimization and monitoring efforts; interacting with vendors; and communicating and collaborating with other groups, teams, projects and sites.The selected candidate will participate in a regularly scheduled rotation of on-call support of production systems, including some systems under 7x24 hour support.  In addition, some non-standard working hours may occasionally be required. This position is full-time and is located at Los Alamos National Laboratory in Los Alamos, New Mexico.  This position will be filled at either the Scientist 2 or Scientist 3 level, depending upon the skills of the selected candidate.  Additional job responsibilities (outlined below) will be assigned if the candidate is hired at the higher level.Scientist 2 ($86,000-$141,800) ·           Participate in periodic on‐call responsibilities.·           Work both independently and collaboratively with other system administrators, as well as under the supervision and guidance of senior HPC system administrators to provide technical assistance in problem solving, configuration management, and day-to-day operation of various supercomputing systems.·           Troubleshoot, diagnose root cause, and isolate the components / failure scenarios while working with internal & external stakeholders.·           Participate in process improvement, including deep multi‐system problem isolation and resolution often in collaboration with administrators of other HPC subsystems. ·           Develop and publish updates on resolutions and communicate findings internally.·           Work with team members to make modifications and additions to existing code, methods and procedures.·           Work with team to bring up new hardware and test functionality.·           Work with team members and vendors to document, design, and implement new ideas and approaches for newer system administration and configuration tools and strategies and improve those for existing ones. ·           Present best practices, experience reports, and/or research results to managers and to peers locally or at conferences.  Scientist 3 ($94,500-$157,800)In addition to the duties outlined above, a successful Scientist 3 candidate will be required to:Work as a technical leader/subject matter expert to propose and implement solutions to current problems and future deficiencies in our HPC networking environment in conjunction with junior and senior administrators and technical staff within and across teams. Proactively create experiments and tooling to validate solutions and to detect and diagnose network and hardware health issues.Analyze published research papers in the area of networking and high-speed interconnects, summarize, and share implications and connections to ongoing work with team members.Interact and/or collaborate with people from other teams, groups, divisions, directorates, and programs to develop, implement, and/or communicate technical solutions.Mentor junior technical staff and students.Present best practices and research results to national peers at conferences, workshops, and meetings, as well as participate in national strategic partnerships. ", "OrganizationName": "HPC-SYS/ Computing Operations & SupportDo the most meaningful work of your careerCome join the best and brightest minds in the world at one of the most innovative and creative multidisciplinary research institutions engaged in strategic science on behalf of U.S. national security.  The work that we do at Los Alamos National Laboratory (LANL) matters to our country and the world.Make a differenceAt LANL, we’re determined to harness science and imagination to make the world a better and safer place by solving complex problems others can’t.  In LANL’s High Performance Computing Division, we are pushing the computing pendulum, designing the future, and empowering scientists across the national laboratory to make an impact.  When you’re in charge of making a difference, there’s no limit to what you can do. Work/Life Balance Our diverse workforce enjoys a collegial work environment focused on creative problem solving, where everyone’s opinions and ideas are valued. We are committed to work-life balance, as well as both personal and professional growth. We consider our creative and dedicated scientific professionals to be our greatest assets, and we take pride in cultivating their talents, supporting their efforts, and enabling their successes. We provide mentoring to help new staff build a solid technical and professional foundation, and to smoothly integrate into the culture of LANL. Compensation and Benefits include:Multiple options for work schedulesExercise facility free for staff useChoice of comprehensive medical plansPaid sick time and disability insurance401k (100% match up to 6% + kicker)Fully vested in 401k on day oneRelocation Assistance (if needed)Los Alamos, New Mexico enjoys excellent weather, clean air, and outstanding public schools. This is a safe, low-crime, family-oriented community with frequent concerts and events as well as quick travel to many top ski resorts, scenic hiking & biking trails, and mountain climbing. The short drive to work includes stunning views of rugged canyons and mesas as well as the Sangre de Cristo mountains. Many employees choose to live in the nearby state capital, Santa Fe, which is known for world-class restaurants, art galleries, and opera. ", "JobTitle": "HPC Cluster Administrator (Scientist 2/3)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=59224&p_spid=2705318&oapc=30&oas=-W2zowMc3qamMYvRjAV5iw..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59224"}, {"WhatYouWillDo": "The High Performance Computing (HPC) Division at Los Alamos National Laboratory provides scientific computing resources consisting of some of the largest HPC systems in the world. The Systems team within the HPC Design Group (HPC-DES) is responsible for defining the technical direction, evaluating, developing and deploying the tools and system software ultimately used in production support of LANL’s HPC resources. These HPC resources are some of the largest in the world and currently include a large (19K+ node) Cray system called Trinity as well as numerous large commodity cluster systems.  This position will be filled at the Scientist 3 or 4 level as dictated by current programmatic needs and the skills of the selected candidate. Job responsibilities will be assigned in accordance with the level at which the selected candidate is hired. We are targeting this position to provide technical leadership and direction with the goal of providing a scalable, usable, maintainable HPC user software environment, with a focus on system job scheduling, application development and runtime environment, monitoring and data analytics. You will be working closely with other DES System team members as well as more production focused team members in other groups at the HPC division.  Projects typically involve collaborations inside and outside of the Laboratory, in line with the Laboratories’ history of leadership in HPC. Some non-standard working hours may occasionally be required. HPC-DES invites applicants for a position of Scientist 3 or 4 to join the DES Systems Software team.  We seek candidates who want to make significant contributions at the local HPC division and ultimately impact HPC technical direction at LANL and across the DOE and the nation.  This position will be filled at either the Scientist 3 or Scientist 4 level, depending on the skills of the selected candidate.  Additional job responsibilities (outlined below) will be assigned if the candidate is hired at the higher level. Scientist 3 ($94,500 - $157,800)The successful candidate will be required to:Work as a technical leader to propose and implement solutions to current problems and future deficiencies in our HPC environment in conjunction with junior and senior administrators and technical members of other HPC teams. As mentioned above, the focus areas for this individual will be system job scheduling, application development and runtime environment, monitoring and data analytics.Assist in the setup, administration and maintenance of various HPC test and evaluation servers for prototype and evaluation use in HPC user software environment. Troubleshoot complicated user job issues that cross multiple technical areas including job scheduling, user environment, and system software stack. Implement active network security monitoring technologies.Evaluate, architect, test and implement expanded job scheduling features, potentially including power management, job throughput, power efficiency and other advanced features.Deploy advanced analytics tools or machine learning techniques on monitoring data for use in our production environment. Communicate the strategies and successes of HPC Division to national peers and participate in national strategic partnerships. Scientist 4 ($114,500 - $192,900)In addition to the duties outlined above, the Scientist 4 will be required to:Develop, propose, defend, and ultimately impact system hardware and software architecture HPC user software environment requirements for next generation HPC systems.Enhance technical and professional expertise of junior and other staff through mentoring and training.Successfully collaborate with potential end users of our monitoring system data and analytics to better define requirements and use cases. Rapidly implement prototype environments for user feedback and suggestions.Lead process improvement and deep multi‐system problem isolation and resolution in coordination with administrators of other HPC subsystems.", "OrganizationName": "HPC-DES/HPC Design", "JobTitle": "HPC-DES System Developer (Scientist 3/4)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=58694&p_spid=2687318&oapc=33&oas=RbpLs-38KzSeGkzYKVIfMw..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58694"}, {"WhatYouWillDo": "HPC is seeking recent graduates looking for a challenging paid post graduate internships at the post-masters level. All selected candidates will be provided with a mentor, a challenging project for their appointment, and an opportunity to present their project work and progress to colleagues.  The projects we have to offer will vary depending on the skills and interests of the candidate and our current needs.", "OrganizationName": "HPC-DO/High Performance Computing", "JobTitle": "High Performance Computing Post Masters Intern", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=59094&p_spid=2687338&oapc=36&oas=L6zItwnq40wGJOzHft3C5Q..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59094"}, {"WhatYouWillDo": "  HPC is seeking recent graduates looking for a challenging paid post graduate internships at the post-baccalaureate level. All selected candidates will be provided with a mentor, a challenging project for their appointment, and an opportunity to present their project work and progress to colleagues.  The projects we have to offer will vary depending on the skills and interests of the candidate and our current needs.", "OrganizationName": "HPC-DO/High Performance Computing ", "JobTitle": "High Performance Computing Post Baccalaureate Intern", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=59071&p_spid=2708315&oapc=39&oas=Ty7c4byxs0zVhFrCMK1pag..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59071"}, {"WhatYouWillDo": "HPC is seeking undergraduate level students looking for a challenging paid internship for the current academic year and/or summer. All selected candidates will be provided with a mentor, a challenging project for their appointment, and an opportunity to present their project work and progress to colleagues.  The student projects we have to offer will vary depending on the skills and interests of the candidate and our current needs.", "OrganizationName": "HPC-DO -High Performance Computing", "JobTitle": "High Performance Computing Upper Undergraduate Student", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=59241&p_spid=2715305&oapc=42&oas=UNa85wwglL41J1R_Tsd8lw..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59241"}, {"WhatYouWillDo": "The successful candidate should have a comprehensive understanding and wide application of operational activities and systems related to the operation and maintenance of High Performance Computing (HPC) Data Centers. This includes the operation of existing data centers; involvement in the planning and determination of both design specifications and performance requirements of new or upgraded state-of-the-art data centers that will serve the growing needs of the Laboratory for modeling and simulation; safety/authorization/compliance basis; health, safety and environmental management; security; quality assurance and work control; equipment engineering; maintenance management; waste management; inventory control, materials purchasing, and packaging/ shipping/receiving activities; and document control/records management.HPC Data Center Specialist 2 ($78,400 – 128,200)Assist in the management of data centers which house the Laboratory's HPC infrastructure and supercomputing systems for the Advanced Simulation and Computing and the Institutional Computing programs.Performs routine facility or area walk-downs, procedure reviews, inspections, and/or evaluations to ensure the safe and efficient operation of the facilities.Assists in performing periodic reviews and assessments to ensure facility systems are operating properly and are being maintained within required limits.Work under guidance of more senior personnel while supporting data center electrical and mechanical systems.Assist with the analysis and issue resolution in regards to power and cooling systems serving HPC systems.Respond to facility emergencies both during normal work hours and outside of regular business hours.Coordinate equipment shutdowns, upgrades, return to service, and/or installations.Monitor the operation of electrical and mechanical equipment supporting the facility and its critical operations.Assist with the preparation and/or review of lock-out/tag-out plans that ensure specific instructions for the isolation, containment, and/or de-energization of various mechanical and electrical sources according to established procedures and facility guidelines.Perform duties consistent with LANL's commitment to a secure, safe and healthy work environment.Work will be reviewed for accuracy, soundness of judgment and overall adequacy.Work occasional weekends, holidays, and overtime as required and be \"on call\" on a rotational schedule of 24 x 7 basis.Perform basic maintenance tasks to the highest caliber, which includes: climb ladders, work in confined spaces, lift heavy objects weighing up to 50 lbs., etc.HPC Data Center Specialist 3 ($86,000 – 141,800)In addition to the duties outlined above, the HPC Data Center Specialist 3 will be required to:Investigate mechanical needs of the data centers; make recommendations for mechanical system upgrades and modifications; and assist with the implementation of those modifications. Independent judgment and latitude should be used throughout these processes/tasks.Monitor the mechanical load and prepare forecasts of future loads to ensure that building systems are adequate, reliable and meet projected computational load requirements.Provide input associated with the supercomputer request for purchasing (RFP) process.Review lock-out/tag-out plans to ensure specific instructions for the isolation, containment, and/or de-energization of various mechanical sources according to established procedures and facility guidelines.Develop optimal solutions to unique or complex problems with conflicting goals and objectives.", "OrganizationName": "HPC-DES/HPC Design", "JobTitle": "HPC Data Center Specialist 2/3", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=59010&p_spid=2705314&oapc=45&oas=opDIFw7_0Y-1uwPBMHqU4A..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59010"}, {"WhatYouWillDo": " HPC is seeking graduate level students looking for a challenging paid internship for the current academic year and/or summer. All selected candidates will be provided with a mentor, a challenging project for their appointment, and an opportunity to present their project work and progress to colleagues.  The student projects we have to offer will vary depending on the skills and interests of the candidate and our current needs.", "OrganizationName": "HPC/DO - High Performance Computing", "JobTitle": "High Performance Computing Graduate Intern", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=59223&p_spid=2705317&oapc=48&oas=Ey4IqOBJKkM2bxM15eoHWA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59223"}, {"WhatYouWillDo": "Join the team of scientists who support one of the most powerful computer centers on the planet.  Los Alamos has a legacy of stretching the boundaries of computational performance and complexity, and we are not slowing down.  From the Maniac II in 1952 through today’s hybrid processor Trinity platform, we have posted many speed records over the decades and are now driving toward Exascale.   Our High-Performance Computing Division provides production high performance computing systems services to the Laboratory. The High Performance Computing Environments group (HPC-ENV) takes responsibility for the broad range of HPC platforms, monitoring and data analytics, programming and runtime environments, software, application support and readiness, user support & services for a large and diverse customer base.  We provide support and services to many production platforms at a world class computing facility to ensure customers can accomplish their research and mission at extreme scale.   The focus for the HPC Consulting team is to support and enhance the productivity of the LANL HPC user community by providing quality technical support in a timely manner.  We achieve this by providing customer focused, single point of contact for HPC systems, services, tools and technical support.  The HPC Consulting Team provides support for all production HPC platforms in various networks, including help for programming languages, debugging, parallel computing, HPC operating systems, utilities, libraries, file systems and interconnects, scripting, archival storage, desktop backup (TSM), file transfer, HPC network, and Tri-Lab support.  The Division’s goal is to create an effective HPC environment in which scientists can be as productive as possible.  Additionally we support selected research activities that we deem important to our mission. Computing Systems Professional 1 (CSP-1) ($59,100 - $93,800) The successful candidate will be required to: ·         Provide tier 1 customer support as part of the Consulting Office within HPC-ENV to scientific users under the supervision and mentorship of senior HPC Consultants·         Participate in the weekly consult support schedule by answering questions, solving technical problems by telephone, electronic mail, and in person·         Interact with end-users and the HPC user support teams.·         Communicating and collaborating frequently with customers and with HPC teams·         Provide storage support for customers using the current backup solution Computing Systems Professional 2 (CSP-2)  ($71,000 - $115,700) In addition to the duties outlined above, the CSP-2 will be required to:·         Contribute to technical HPC documentation and presentations ·         Responsible for a variety of shorter term issue while steadily increasing responsibilities as knowledge of our environment and HPC systems increases·         Participate in process improvement and resolution in coordination with other Consultants and HPC Teams.·         Propose and implement solutions when presented with projects in our HPC environment. Computing Systems Professional 3 (CSP-3) ($86,000 - $141,800) In addition to the duties outlined above, the CSP-3 will be required to:·         Provide in-depth customer support as part of the Consulting Team within HPC-ENV to scientific users in the areas of programming languages, operating systems, storage, libraries, utilities, code performance and other facets of the HPC environment·         Work independently and responsible for taking on a range of issues from short to medium term issues·         Communicating and collaborating frequently with customers, other cross-Group and cross-Division teams as well as other HPC sites·         Provide technical and professional expertise to students or junior staff through mentoring and training ", "OrganizationName": "HPC-ENV/HPC Environments", "JobTitle": "Computing Systems Professional 1/2/3", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=58696&p_spid=2687320&oapc=51&oas=hhrj5i1q_cNtjzMv_3ZMmg..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58696"}, {"WhatYouWillDo": " High performance computing is a powerful tool that when put into the hands of creative minds is helping humanity solve its hardest problems.  Supercomputers help us see structure in the chaos, find signals in the noise, and turn trillions of data points into answers to unlock radical innovation.  The High Performance Computing (HPC) Networking Team provides vanguard production support, research, and development for existing and future high speed networks and interconnects that feed and unleash the power of the supercomputer.  The Networking Team designs, builds and maintains some of the largest, fastest, and secure networks for both data movement and system capability in the world, including systems supporting up to 100 Gigabit per second of throughput and continuing to grow.  We provide network technology spanning the full range of tiers from campus networks to highest speed cluster interconnects for some of the largest and fastest supercomputers in the world. The HPC Networking Team is responsible for all aspects of networking within the HPC environment across three separate networks.  This includes Ethernet, InfiniBand, and Omni-Path networks used within more than a dozen high performance computing resources.  This also includes significantly complex Ethernet networks that control and manage access between the clusters and external resources. The successful candidate will support design, deployment, and maintenance efforts for networks within the HPC environment.  Builders and problem-solvers at heart, the HPC Networking Team seeks highly motivated, productive, inquisitive, and multi-talented candidates who are equally comfortable working independently as well as part of a team.  The successful applicant will acquire the skills needed to take a leading role in working on all aspects of LANL’s HPC networking infrastructure.  A broad range of expertise and background is desired in the team, and there are multiple projects that a successful candidate can pursue within the production and research disciplines of the team.  There are frequent opportunities for collaborative work with scientists and staff within the group (for instance with scientists designing and operating our high-speed data storage infrastructure) or with scientists from other groups, including close collaborative research opportunities with LANL’s Ultrascale Systems Research Center (USRC), to help drive cutting edge advances. This role requires strong communication skills, as well as comprehensive troubleshooting and analytical skills.  Team member duties include: designing, building, and maintaining world-class data movement and storage networks, which includes HPC network core, file system connectivity, and computing interconnects; evaluating and testing new technology and solutions; system administration of HPC network infrastructure in support of compute clusters; diagnosing, solving, and implementing solutions for various system operational problems; Troubleshooting issues, management/maintenance of all routing and switch infrastructure within HPC compute clusters; developing tools to support automation, optimization and monitoring efforts; interacting with vendors; and communicating and collaborating with other groups, teams, projects and sites. The selected candidate will participate in a regularly scheduled rotation of on-call support of production systems, including some systems under 7x24 hour support.  In addition, some non-standard working hours may occasionally be required. This position is full-time and is located at Los Alamos National Laboratory in Los Alamos, New Mexico.   This position will be filled at either the Scientist 2 or Scientist 3 level, depending upon the skills of the selected candidate. Additional job responsibilities (outlined below) will be assigned if the candidate is hired at the higher level. Scientist 2 ($86,000-$141,800)Participate in periodic on-call responsibilities.Work both independently and collaboratively with other members of the team or group after receiving initial direction and requirements from technical project leads.Troubleshoot, diagnose root cause of network failures, and isolate the components / failure scenarios while working with internal & external stakeholders.Contributing to the physical deployment or relocation of HPC network and/or interconnect cabling and hardware.Develop and publish updates on resolutions and communicate findings internally.Work with team members to make modifications and additions to existing networks, methods and procedures.Work with team to bring up new hardware and test functionality.Participate in process improvement, including deep multi‐system problem isolation and resolution often in collaboration with administrators of other HPC subsystems. Work with team members and vendors to document, design, and implement new ideas and approaches for newer network topologies and improve those for existing ones. Present best practices, experience reports, and/or research results to managers and to peers locally or at conferences. Scientist 3 ($94,500-$157,800)In addition to the duties outlined above, a successful Scientist 3 candidate will be required to:Work as a technical leader/subject matter expert to propose and implement solutions to current problems and future deficiencies in our HPC networking environment in conjunction with junior and senior administrators and technical staff within and across teams. Proactively create experiments and tooling to validate solutions and to detect and diagnose network and hardware health issues.Analyze published research papers in the area of networking and high-speed interconnects, summarize, and share implications and connections to ongoing work with team members.Interact and/or collaborate with people from other teams, groups, divisions, directorates, and programs to develop, implement, and/or communicate technical solutions.Mentor junior technical staff and students.Present best practices and research results to national peers at conferences, workshops, and meetings, as well as participate in national strategic partnerships.", "OrganizationName": "HPC-SYS/HPC Systems Do the most meaningful work of your careerCome join the best and brightest minds in the world at one of the most innovative and creative multidisciplinary research institutions engaged in strategic science on behalf of U.S. national security.  The work that we do at Los Alamos National Laboratory (LANL) matters to our country and the world. Make a differenceAt LANL, we’re determined to harness science and imagination to make the world a better and safer place by solving complex problems others can’t.  In LANL’s High Performance Computing Division, we are pushing the computing pendulum, designing the future, and empowering scientists across the national laboratory to make an impact.  When you’re in charge of making a difference, there’s no limit to what you can do. Work/Life Balance Our diverse workforce enjoys a collegial work environment focused on creative problem solving, where everyone’s opinions and ideas are valued. We are committed to work-life balance, as well as both personal and professional growth. We consider our creative and dedicated scientific professionals to be our greatest assets, and we take pride in cultivating their talents, supporting their efforts, and enabling their successes. We provide mentoring to help new staff build a solid technical and professional foundation, and to smoothly integrate into the culture of LANL. Compensation and Benefits include:Multiple options for work schedulesExercise facility free for staff useChoice of comprehensive medical plansPaid sick time and disability insurance401k (100% match up to 6% + kicker)Fully vested in 401k on day oneRelocation Assistance (if needed)Los Alamos, New Mexico enjoys excellent weather, clean air, and outstanding public schools. This is a safe, low-crime, family-oriented community with frequent concerts and events as well as quick travel to many top ski resorts, scenic hiking & biking trails, and mountain climbing. The short drive to work includes stunning views of rugged canyons and mesas as well as the Sangre de Cristo mountains. Many employees choose to live in the nearby state capital, Santa Fe, which is known for world-class restaurants, art galleries, and opera.  ", "JobTitle": "HPC Network Administrator (Scientist 2/3)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=58698&p_spid=2687322&oapc=54&oas=AIA7hTYAOXBfFO6-wBgMsg..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58698"}, {"WhatYouWillDo": "  High performance computing is a powerful tool that when put into the hands of creative minds is helping humanity solve its hardest problems.  Supercomputers help us see structure in the chaos, find signals in the noise, and turn trillions of data points into answers to unlock radical innovation.  The High Performance Computing (HPC) Data Storage Team provides vanguard production support, research, and development for existing and future systems that feed and unleash the power of the supercomputer.  The Data Storage Team designs, builds and maintains some of the largest, fastest and most complex data movement and storage systems in the world, including systems supporting 100 Petabytes of capacity.  We provide storage systems spanning the full range of tiers from the most resilient archival systems to the pinnacle of high-speed storage, including all-flash file systems and systems supplying bandwidth that exceeds a terabyte per second to some of the largest and fastest supercomputers in the world. Innovators and builders at heart, the Data Storage team seeks highly motivated, productive, inquisitive, and multi-talented candidates who are equally comfortable working independently as well as part of a team.  The successful applicant will acquire the skills needed to take a leading role in working on all aspects of LANL’s HPC data movement and storage infrastructure.  A broad range of expertise and background is desired in the team, and there are multiple projects that a successful candidate can pursue within the production and research disciplines of the team.  There are frequent opportunities for collaborative work with scientists and staff within the group (for instance with scientists designing and operating our high-speed networking infrastructure) or with scientists from other groups, including close collaborative research opportunities with LANL’s Ultrascale Systems Research Center (USRC), to help drive cutting edge advances. This role requires strong communication skills, as well as comprehensive troubleshooting and analytical skills.  Team member duties include: designing, building, and maintaining world-class data movement and storage systems; evaluating and testing new technology and solutions; system administration of HPC storage infrastructure in support of compute clusters; diagnosing, solving, and implementing solutions for various system operational problems; tuning file systems to increase performance and reliability of services; process automation; interacting with vendors; and communicating and collaborating with other groups, teams, projects and sites. The selected candidate will participate in a regularly scheduled rotation of on-call support of production systems, including some systems under 7x24 hour support.  In addition, some non-standard working hours may occasionally be required. This position is full-time and is located at Los Alamos National Laboratory in Los Alamos, New Mexico.   This position will be filled at either the Scientist 2 or Scientist 3 level, depending upon the skills of the selected candidate.  Additional job responsibilities (outlined below) will be assigned if the candidate is hired at the higher level. Scientist 2 ($86,000-$141,800)Participate in periodic on-call responsibilities.Work both independently and collaboratively with other members of the team or group after receiving initial direction and requirements from technical project leads.Troubleshoot, diagnose root cause of system failures, and isolate the components / failure scenarios while working with internal & external stakeholdersDevelop and publish updates on resolutions and communicate findings internally.Work with team members to make modifications and additions to existing systems, code, and methods.Work with team to bring up new hardware and test functionality.Participate in process improvement, including deep multi-system problem isolation and resolution often in collaboration with administrators of other HPC subsystems. Work with team members to document, design, and implement new ideas and approaches for newer architectures and improve those for existing ones. Present best practices, experience reports, and/or research results to managers and to peers locally or at conferences. Scientist 3 ($94,500-$157,800)In addition to the duties outlined above, a successful Scientist 3 candidate will be required to:Work as a technical leader/subject matter expert to propose and implement solutions to current problems and future deficiencies in our HPC data storage environment in conjunction with junior and senior administrators and technical staff within and across teams. Proactively create experiments and tooling to validate solutions and to detect and diagnose hardware health issues.Analyze published research papers in the area of data storage, summarize, and share implications and connections to ongoing work with team members.Interact and/or collaborate with people from other teams, groups, divisions, directorates, and programs to develop, implement, and/or communicate technical solutions.Mentor junior technical staff and students.Present best practices and research results to national peers at conferences, workshops, and meetings, as well as participate in national strategic partnerships. ", "OrganizationName": "HPC-SYS/HPC Systems Do the most meaningful work of your careerCome join the best and brightest minds in the world at one of the most innovative and creative multidisciplinary research institutions engaged in strategic science on behalf of U.S. national security.  The work that we do at Los Alamos National Laboratory (LANL) matters to our country and the world. Make a differenceAt LANL, we’re determined to harness science and imagination to make the world a better and safer place by solving complex problems others can’t.  In LANL’s High Performance Computing Division, we are pushing the computing pendulum, designing the future, and empowering scientists across the national laboratory to make an impact.  When you’re in charge of making a difference, there’s no limit to what you can do. Work/Life Balance Our diverse workforce enjoys a collegial work environment focused on creative problem solving, where everyone’s opinions and ideas are valued. We are committed to work-life balance, as well as both personal and professional growth. We consider our creative and dedicated scientific professionals to be our greatest assets, and we take pride in cultivating their talents, supporting their efforts, and enabling their successes. We provide mentoring to help new staff build a solid technical and professional foundation, and to smoothly integrate into the culture of LANL. Compensation and Benefits include:Multiple options for work schedulesExercise facility free for staff useChoice of comprehensive medical plansPaid sick time and disability insurance401k (100% match up to 6% + kicker)Fully vested in 401k on day oneRelocation Assistance (if needed)Los Alamos, New Mexico enjoys excellent weather, clean air, and outstanding public schools. This is a safe, low-crime, family-oriented community with frequent concerts and events as well as quick travel to many top ski resorts, scenic hiking & biking trails, and mountain climbing. The short drive to work includes stunning views of rugged canyons and mesas as well as the Sangre de Cristo mountains. Many employees choose to live in the nearby state capital, Santa Fe, which is known for world-class restaurants, art galleries, and opera. ", "JobTitle": "HPC Data Storage Administrator (Scientist 2/3)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=58697&p_spid=2687321&oapc=57&oas=_XW4q6nuMIHX_1m5pikJOw..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58697"}, {"WhatYouWillDo": "Come join the best and brightest minds in the world at one of the most innovative and creative multidisciplinary research institutions engaged in strategic science on behalf of national security. The work we do at Los Alamos National Laboratory (LANL) matters to our country and the world.  The positions is advertised at the Scientist 2 and 3 level with the Scientist 2 equivalent to assistant professor level in academia and the Scientist 3 corresponding to associate professor in academia.LANL is seeking an exceptional computational and theoretical biophysicist with a strong background in theory and track record of extraordinary achievement to join the Theoretical Biology and Biophysics Group in T-Division. The successful candidate will have a demonstrated track record of high quality scientific productivity, as indicated by a significant publication record, invited talks, and professional recognition.  Demonstrated ability to perform trans disciplinary research is essential, and the flexibility to engage in both basic and applied research, is required. Relevant areas of experience include the development of methods for molecular dynamics simulations, such as enhanced sampling methods, free-energy calculations, or statistical approaches for analyzing large data sets.  Scientist 2 ($86,000-$141,800)The successful candidate will be required to:Perform independent research in basic and/or applied research related to human diseases from the molecular to the cellular to within host levels to gain fundamental understanding of disease and treatment.Engage the vibrant intellectual community in the Theoretical Biology and Biophysics group, the Theoretical Division, and the broader LANL research community to contribute to existing research programsActively seek opportunities to attract potential sponsors, both within and outside LANL, to develop independently funded researchEstablish collaborations with experimental laboratories and the ability to exploit data collected by other entities to support modeling and simulations.  Contribute to existing projects that require multiscale modeling of large biomolecular systems in complex, heterogeneous environments. Scientist 3 Title ($94,500-$157,800)In addition to the duties outlined above, the (higher level title) will be required to:Mentor postdoctoral fellows and, possibly, students Be engaged in the national and international scientific community in theoretical biology and biophysicsSets direction and goals for well-defined tasks and deliverables involving more than one person", "OrganizationName": "T-6 / Theoretical Biology And Biophysics", "JobTitle": "Scientist 2/3", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=58666&p_spid=2686310&oapc=60&oas=NaSHv4y6qj4AXEaVUTguVg..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58666"}, {"WhatYouWillDo": "X-Theoretical Design (XTD) division members are the scientific stewards of the U.S. nuclear stockpile, applying theoretical and computational physics to the performance and safety of nuclear weapons. XTD scientists also contribute their expertise to the nation’ sforeign threat assessment, counter-proliferation and non-proliferation efforts through assessment of foreign devices, design of tools to address nuclear emergency response scenarios, and creation of solutions to inhibit nuclear proliferation. In addition, XTD scientists drive cutting edge advances in astrophysics, geophysics, high energy density physics, inertial confinement fusion, chemistry, and material science. Members of XTD use multi-physics codes, running on some of the world’s fastest supercomputers, to create and analyze simulations of very complex systems. We work closely with many other organizations in a diverse variety of tasks, including experimental design and analysis, model development, code validation, and project leadership. The selected candidate will:Demonstrate a thorough knowledge of and capability with large, multi-physics codes. Apply multi-physics codes to solve problems of national security interest, exercising personal initiative to guide your own and others’ efforts.Contribute to one or more of the related tasks: contributing to experimental design and analysis, coordinate with model development efforts, project leadership, data evaluation, and code validation.Contribute leadership skills to team efforts. Contribute to organizational knowledge level by mentoring others.Continue to expand your technical knowledge.Demonstrate generalist capabilities in solving problems.Work with a wide variety of colleagues with varying backgrounds on research covering multiple physics areas in order to solve difficult problems.Demonstrate and maintain excellence in communication, both written and verbal. ", "OrganizationName": "XTD-DO/X Theoretical Design", "JobTitle": "Theoretical Design Scientist (Scientist 3)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=58682&p_spid=2687306&oapc=63&oas=KueClQup_QypzriZy4t6kw..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58682"}, {"WhatYouWillDo": " The Center for Theoretical Astrophysics (CTA) is seeking candidates for one or more postdoctoral positions in computational astrophysics, particularly in topics relating to:·         Cosmology calculations using a broad range of tools, focused on studying the formation of the first stars and black holes;·         Evolution of massive black holes, studying both radiation and magneto-hydrodynamic effects;·         Star and planet formation;·         Engines of thermonuclear and core-collapse supernovae, gamma-ray bursts, and x-ray bursts;·         Understanding the behavior of matter at nuclear densities and applying these effects (neutrinos, equations of state) to supernova models;·         Nucleosynthetic yields from stars and supernovae, nuclear cross-sections (tying to experiment), and galactic chemical evolution;·         Following supernovae through the remnant phase, including effects of NLTE opacities and magneto-hydrodynamics;·         Modeling spectra and light-curves from transients, including radiation-hydrodynamic effects and atomic physics;·         Generation and propagation of cosmic rays from gamma-ray bursts and supernovae, with ties to a number of missions such as HAWC and NuSTAR;·         Asteroid impacts and planetary physics.The CTA additionally has ties to various experimental astrophysics groups, leveraging expertise in plasma physics, turbulence, radiation transport, nuclear physics, and atomic physics. ", "OrganizationName": "Center for Theoretical Astrophysics", "JobTitle": "Computational Astrophysics Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=58662&p_spid=2686306&oapc=66&oas=rY8YKzo3eOecxe4BkeZ_jw..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58662"}, {"WhatYouWillDo": " The Information Sciences group (CCS‐3) of Los Alamos National Laboratory (LANL) has an opening for outstanding postdoctoral research associates in the area of combinatorial optimization. The selected candidates will be given the opportunity to work with one of the only four commercially available quantum annealing computers worldwide, D-Wave 2X, with more than 1000 qubits. Typical tasks involve formulating an NP-hard optimization problem as a quadratic unconstraint binary optimization (QUBO) problem and designing methods for improving quantum annealing scalability and accuracy.Quantum annealing is considered as one of the promising exascale and “beyond Moore’s law” computing technologies. Quantum annealers such as LANL’s D-Wave 2X are designed to natively propose solutions for optimization problems that are known to be challenging for classical computers. Preliminary knowledge about quantum physics or quantum computing is not a requirement for this position, but strong combinatorial algorithm design and implementation skills are essential.", "OrganizationName": "CCS-3/nformation Sciences", "JobTitle": "Optimization Algorithms for Post-Moore-Era Supercomputing Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=58529&p_spid=2679313&oapc=69&oas=p2RkOyN6AQLdC8VmYGTCIw..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58529"}, {"WhatYouWillDo": "The Space and Remote Sensing (ISR-2) and Space Instrument Realization (ISR-5) Groups at Los Alamos National Laboratory are seeking a qualified optical or electro-optical technician to participate in the execution of ISR’s portfolio of optical sensing programs. These programs include spectral sensing; high-speed imaging; ultra-low-light imaging including advanced photon counting detectors; and passive/active remote sensing. Each of the program topics intersects with one or more of the following focus areas:Design of innovative optical sensors and instruments using both improved concepts based on demonstrated principles and the development of new detection principlesDevelopment and field deployment of complete autonomous hardware/software systems for sky surveillance, space situational awareness, and other applicationsDevelopment of algorithms and techniques for optical imaging and time-series data, removal of the instrumental signatures, signal detection and characterization, and high-level statistical inference in data intensive settingsThe design, execution, and analysis of broad area searches in large collections of static and streaming data coupled with autonomous follow-up of interesting targetsSource-to-sensor modeling, including modeling of source physics, signal propagation, sensor performance, and the validation of the data processing and analysis algorithmsAstro-dynamical modeling and prediction, including initial orbit determination, orbit propagation, and simulation of observing geometryScientific and statistical analysis of data coupled with theoretical modeling and understanding the underlying emission and propagation physics", "OrganizationName": "ISR-5/ Space Instrumentation Realization", "JobTitle": "Optical Technician (Development & FabricationTec 3/4)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=58300&p_spid=2668304&oapc=72&oas=kjR7RmXr3CuXs08Y6Pg-Ig..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58300"}, {"WhatYouWillDo": " Manage the Energy and Utilities Management Improvement initiatives and direct engineering staff to accomplish the tasks necessary to achieve success.Assignments are wide in scope which entails project management, performing to LANL Conduct of Engineering (CoE) policies and procedures.Ensure the overall safety and security of the deployed engineering team.Timely delivery of quality products and services that meet customer requirements.Provide technical leadership and management of several teams for engineering activities performed for the Facility Operations Director (FODs).Provide technical support for utility and system engineering.Manage plant system engineers to support the utilities measures.Participate in the planning, coordination, and implementation of engineering management assessments of engineering and configuration management activities.As owner of the Building Automation Systems (BAS systems), coordinate BAS activities between re-commissioning team, operations and system engineering personnel to ensure activity outcomes leave systems functional and activities meet CoE requirements.Ensure preventive maintenance activities are defined and placed in CMMS/Passport for BAS and other systems as appropriate.Meet weekly with major customers, such as High Performance Computing (HPC), to ensure expectations are established and met.Perform DAR functions for facilities, when qualified.Assist the ES Division with audits and assessments by DOE and NNSA representatives and other external entities.", "OrganizationName": "EU-UI/Facility System Engineering Util & Infrastructure", "JobTitle": "Engineering Manager 3", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=58222&p_spid=2666297&oapc=75&oas=s6AW4gJkzUpZ8pZtYm0X_g..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58222"}, {"WhatYouWillDo": " The Plasma Physics Team with the CCS-2 group (Computational Physics and Methods Group, Computer and Computational Sciences Division) at Los Alamos National Laboratory is seeking candidates for postdoctoral positions in multi-scale modeling of dense plasmas. The successful candidate will:Work on a team to develop new computational models that span the physics of cool dense matter to hot dense matter, working as a team to incorporate results into practically useful reduced order models.Perform simulations in the cool dense matter regime using ab initio molecular dynamics (AIMD) methods connecting to kinetic theory models or fluid closures. Work at integrating models across MD, Kinetic Theory and Fluid closure models Publish in the highest-quality journals and present at national and international conferences. Be the expert on warm dense matter as part of a multidisciplinary team.Connect research directly to experiments, such as those at NIF and the Linac Coherent Light Source (LCLS) at SLAC. ", "OrganizationName": "CCS-2/Computational Physics And Methods", "JobTitle": "Multi-Scale Modeling in Warm-Dense Matter Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1612388839&retainAM=N&addBreadCrumb=RP&p_svid=58120&p_spid=2662291&oapc=78&oas=H6OSe2U05DV6G4mixxnCYQ..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58120"}], "ComputationalScience": [{"Location": "Los Alamos, NM, US", "JobTitle": "Scientist 2/3", "OrganizationName": "T-1/ Physics & Chemistry Of MaterialsWhat You Will This position will be filled at either the Scientist 2/3 level, depending on the skills of the selected candidate.  Additional job responsibilities (outlined below) will be assigned if the candidate is hired at the higher level. The candidate will be expected to perform outstanding research in the area of computational physics and chemistry on problems concerning properties and dynamics of materials under extreme conditions. T-1 staff performs research and development in these areas using a wide range of techniques, spanning multiple length scales, from the atomic to the continuum.  Scientist 2 ($84,300 - $139,000)The successful candidate will be required to:Lead independent researchWork in inter-disciplinary teams, encompassing theorists and experimentalists, to develop new theoretical and computational tools for prediction of materials properties under extreme conditionsSubmit grant proposals for competitive funding calls as appropriateCommunicate research findings via journal articles, internal and external reports, and presentationsRecruit and mentor post-doctoral fellows and graduate students Scientist Level 3 ($92,600 - $154,600)In addition to the duties outlined above, the Scientist 3 will be required to:Lead technical decision making and direction at the project or team levelCoordinate the work of others and serve as a role model for creative technical leadership within the team. What You NeedMinimum Job Requirements:Demonstrated knowledge of and relevant experience in one or more of the research areas described abovePhD in Physics, Chemistry, or Materials Science or a closely related discipline.Strong background in computer programming using modern computing languagesExperience in running large-scale computational physics, chemistry, or materials science codes based on atomistic quantum-chemical approaches and/or molecular dynamics using classical force-fields and/or continuum modelsAdditional Job Requirements for (higher level title):In addition to the Job Requirements outlined above, qualification at the Scientist 3 level requires:Experience in development and analysis of models that describe materials under extreme conditions.Demonstrated experience and success in proposal writing, project management and mentoring.Desired Skills: Background in thermodynamics and understanding of materials under extreme conditions. Prediction of material properties under such conditions using modern computational approaches, such as density functional theory.Experience working with high-performance computing systems.Experience in multi-scale type simulations, bridging two or more time and/or length scalesAbility to obtain a Q clearance Education Required:Lower Level: PhD in Chemistry, Physics, or Material Science or a closely related discipline with research areas related to calculation of materials properties Higher Level Education Required:  Ph. D in Chemistry, Physics, or Material Science or a closely related discipline with research areas related to calculation of materials propertiesNotes to Applicants: Please include a curriculum vitae, names of three references, and a cover letter detailing qualifications and research interests that are specific to the job requirements outlined in this job advertisement with your application.Additional Details:Clearance: Q (Position will be cleared to this level).  Applicants selected will be subject to a Federal background investigation and must meet eligibility requirements* for access to classified matter. *Eligibility requirements:  To obtain a clearance, an individual must be at least 18 years of age; U.S. citizenship is required except in very limited circumstances. See DOE Order 472.2 for additional information.New-Employment Drug Test: The Laboratory requires successful applicants to complete a new-employment drug test and maintains a substance abuse policy that includes random drug testing.Term position: Regular-status Laboratory employees applying for term-status positions may retain regular status with approval of the cognizant Principle Associate Director.Equal Opportunity: Los Alamos National Laboratory is an equal opportunity employer and supports a diverse and inclusive workforce. All employment practices are based on qualification and merit, without regards to race, color, national origin, ancestry, religion, age, sex, gender identity, sexual orientation or preference, marital status or spousal affiliation, physical or mental disability, medical conditions, pregnancy, status as a protected veteran, genetic information, or citizenship within the limits imposed by federal laws and regulations.  The Laboratory is also committed to making our workplace accessible to individuals with disabilities and will provide reasonable accommodations, upon request, for individuals to participate in the application and hiring process. To request such an accommodation, please send an email to applyhelp@lanl.gov or call 1-505-665-4444 option 1.Where You Will Work Located in northern New Mexico, Los Alamos National Laboratory (LANL) is a multidisciplinary research institution engaged in strategic science on behalf of national security.  LANL enhances national security by ensuring the safety and reliability of the U.S. nuclear stockpile, developing technologies to reduce threats from weapons of mass destruction, and solving problems related to energy, environment, infrastructure, health, and global security concerns.Appointment TypeTerm AppointmentTerm AppointmentMinimum SalaryMaximum Salary", "VacancyNumber": "IRC59565", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59565&p_spid=2730309&oapc=84&oas=klo8ShcQhHWRHimVvzaSSA.."}, {"Location": "Los Alamos, NM, US", "JobTitle": "Metropolis Postdoc Fellow", "OrganizationName": "ASC Program OfficeNICHOLAS C. METROPOLIS POSTDOCTORAL FELLOWSHIP:  Los Alamos National Laboratory (LANL) addresses national security needs through cutting-edge experimental, theoretical, and computational science, and engineering research using the newest and most advanced experimental and computational facilities in the US and around the world.   Under the Advanced Simulation and Computing (ASC) Program, computer simulation capabilities are developed to support the stockpile stewardship program together with broader national nuclear security needs. ASC is a lead agency within the DOE for development of advanced computer architectures.LANL seeks applications from outstanding candidates in the areas of computational and computer science, physics, and engineering to be considered for the Nicholas C. Metropolis Postdoctoral Fellowship in Computational and Computer Sciences.  Selected candidates will have the opportunity to use the most powerful supercomputers in the world to perform pioneering research in these disciplines:Research into complex, multi-physics, integrated numerical simulations and algorithms, including efficient use of advanced architectures for multi-physics codes.Development, validation, and incorporation of new physics and engineering models for integrated codes.  These models include research into fluid mechanics, turbulence, microscopic and macroscopic models of material properties, warm dense matter, high explosives, plasma, nuclear, and atomic physics, and the transport of particles and x-rays.Development and application of fundamental physics codes to investigate relevant physics phenomena in these disciplines, including efficient use of advanced architectures.Verification and validation methodology and application, including development of a technically rigorous foundation to assess the confidence of simulation code results.Computer science and system development, including emerging technologies and investigation of advanced architectural concepts, system software, programming models, advanced storage and networking technologies, system and application resiliency, and numerical algorithms; system and application co-design for emerging technologies.Required Skills:  Demonstrated success in performing, analyzing, and publishing high quality research in these disciplines and related areas of research.   Excellent communication skills and ability to work independently with minimal supervision.Education:  Ph.D. in related fields completed within the last five years or soon to be completed.Q clearance required. Applicants selected will be subject to a Federal background investigation and must meet eligibility requirements* for access to classified matter. *Eligibility requirements:  To obtain a clearance, an individual must be at least 18 years of age; U.S. citizenship is required except in very limited circumstances. See DOE Order 472.2 for additional information. Notes to Applicants:  For technical questions email metropolis@lanl.gov. Deadline for submitting an application to be considered during the February quarterly review is November 30, 2017.New-Employment Drug Test: The Laboratory requires successful applicants to complete a new-employment drug test and maintains a substance abuse policy that includes random drug testing. Candidates may be considered for a Director's Postdoc Fellowship and outstanding candidates may be considered for the prestigious Richard P. Feynman, Darleane Christian Hoffman, J. Robert Oppenheimer, or Frederick Reines Distinguished Postdoc Fellowships. For general information refer to the Postdoctoral Program page. Equal Opportunity: Los Alamos National Laboratory is an equal opportunity employer and supports a diverse and inclusive workforce.  We welcome and encourage applications from the broadest possible range of qualified candidates.  The Laboratory is also committed to making our workplace accessible to individuals with disabilities and will provide reasonable accommodations, upon request, for individuals to participate in the application and hiring process.  To request such an accommodation, please send an email to applyhelp@lanl.gov or call 1-505-665-5627. Appointment TypePostdocPostdocMinimum SalaryMaximum Salary", "VacancyNumber": "IRC59661", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59661&p_spid=2734305&oapc=87&oas=Lq6h8fCdNctC_dcZ9nxwxQ.."}, {"WhatYouWillDo": "The Systems Design and Analysis Group (NEN-5) is seeking Postdoctoral researchers with interests in one or more of the areas listed below for a two year internship, with possible third year extension.  The Postdoc will partner with staff to conduct research in an area that is closely aligned with their academic interests. The Postdoc may gain experience in:Solving important and challenging radiation transport problems for a variety of applications.Developing and applying tools for high-fidelity simulations of reactor cores.High‐fidelity computational modeling of a range of phenomena including nuclear fuel performance and other thermo‐mechanical processes.Reactor design and demonstration, including analysis of issues related to neutronics, structural mechanics, heat transfer, fluid flow, and safety.Integrated systems analyses related to nuclear security.International and domestic safeguards approaches for all steps in the nuclear fuel cycle.There are opportunities for technically advanced work performed here to be published in journals or conference proceedings. The Postdoc will be encouraged to present final results in an oral presentation and/or poster format.", "OrganizationName": "NEN-5/Systems Design & Analysis Where You Will Work Located in northern New Mexico, Los Alamos National Laboratory (LANL) is a multidisciplinary research institution engaged in science and engineering on behalf of national security.  The Nuclear Engineering and Nonproliferation (NEN) Division is a focal point for the Laboratory’s nuclear engineering and nonproliferation work in support of international security.  Within NEN Division, the Systems Design and Analysis Group (NEN‐5) maintains strong capabilities and recognized expertise in (1) radiation transport code development and modeling for global security applications, (2) methods development and applications for high‐fidelity simulations of reactor cores and nuclear fuel, (3) design and demonstration of special‐purpose reactor concepts for space and terrestrial applications, (4) integrated decision support, risk assessment, and strategic planning for systems related to Global Nuclear Security, and (5) knowledge of nuclear fuel cycles and analytical skills to develop novel solutions to safeguards challenges.", "JobTitle": "Nuclear Engineering & Nonproliferation Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59630&p_spid=2735305&oapc=90&oas=2Wn7z5PBPX2IuLNSzgL36g..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59630"}, {"WhatYouWillDo": " The Program Manager for Inertial Confinement Fusion (ICF) will direct the program’s pursuit of laboratory thermonuclear ignition and robust burn, for stockpile stewardship.  The program’s enabling competencies include the study of thermonuclear burn; the design of cutting edge experimental platforms for conducting weapons-related research at the nation’s flagship high energy density (HED) NIF, Z, and Omega facilities; and the development of cutting-edge diagnostics to measure the extreme conditions produced in these environments. The principal customer base for this program area is DOE’s NNSA Defense Programs. LANL’s ICF Program will play a key role in the national discourse on the path to ignition and robust burn platforms, and in the development of the technical case for a next generation HED facility.  In order to achieve these aims, the successful candidate will strengthen the program’s collaborations with key national partners and enhance its synergies with the HED portfolio of LANL’s Science Program.The ICF major technical elements (MTE) projects include: 1.      Ignition: This MTE supports research activities that optimize prospects for achieving ICF ignition and the development and applications of robust, burning-plasma platforms.2.      Support of Other Stockpile Programs:  This MTE supports nuclear weapons-relevant HED physics needs, developing and integrating the experimental infrastructure and capabilities required to execute experiments on HED facilities.3.      Diagnostics, Cryogenics & Experimental Support:  This MTE develops the specialized technologies needed for ignition and HED experiments on HED facilities. At LANL, it emphasizes the design and engineering of complex diagnostic and measurement systems that operate in the harsh HED environment.  4.      Facility Operations & Target Production:  This MTE funds experimental operations and sophisticated target fabrication  The ICF and Science Programs at LANL are now managed jointly.  The ICF Program Manager will be responsible for working with the Program Director for the ICF/Science Programs and the Science Program Managers to set strategic direction for and steward the HED endeavors of the programs.  The principal responsibilities of the Program Manager are: ·        Provide leadership for the direction and execution of the program·        Establish a highly functioning ICF leadership team·        Advocate for the development and funding of new initiatives and partnerships to meet ICF and weapons program drivers·        Partner closely with the Science Campaign 1 and Campaign 4 HED leaders to advance the synergistic goals of the programs·        Partner closely with LANL program (e.g., Science, DSW, ASC) and line (e.g., ADX, ADEPS) leadership stakeholders and customers for the ICF program·        Foster effective external partnerships with HQ and with counterparts at LLNL, SNL, LLE, NRL, and GA; with the national HED facilities’ management and staff; and with other external customers and stakeholders·        Enable delivery of ICF Program products and milestones·        Implement a rigorous experimental review process, which spans the experimental lifecycle, from idea genesis through data impact·        Lead programmatic and financial elements of the ICF Program at Los Alamos, including working with the Science Program Managers, CFO, project controls, and the stakeholder division leaders to manage the program·        Effectively address Laboratory goals for programmatic, business, and operational excellence The ICF Program Manager must demonstrate commitment to the Laboratory mission of excellence in science, technology, and engineering, demonstrating integrity, establishing trust, and commitment to diversity and excellence in the workforce. The successful candidate will have the responsibility to interface with multiple communities internal and external to the laboratory.  The DOE interface responsibilities involve providing requisite documentation (Implementation Plans), and milestone and budget reporting and coordination with NNSA personnel.  The ICF PM reports to the ICF Program Director.", "OrganizationName": "ADX/AD Weapons Physics", "JobTitle": "ICF Program Manager 4 (Program Manager 4)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59625&p_spid=2733309&oapc=93&oas=NGqWwgTeZ54bAh1B8g6ULQ..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59625"}, {"WhatYouWillDo": " The Eulerian Codes Group, XCP-2, of the Computational Physics Division at Los Alamos National Laboratory (LANL), is seeking an outstanding postdoc candidate to perform code development in the area of laser ray-tracing in an Eulerian radiation-hydrodynamics code.  The successful candidate will work in close collaboration with scientists from both LANL and the Laboratory for Laser Energetics (LLE) at the University of Rochester, and will spend approximately 25% of their time at LANL and 75% of their time at LLE. Description: The Eulerian Codes Group (XCP-2) in the Computational Physics (XCP) Division at Los Alamos National Laboratory has an opening for a postdoctoral position in code development and modeling related to plasma physics and Inertial Confinement Fusion (ICF), specifically in the area of laser ray-tracing.  XCP-2 supports and develops the xRAGE Radiation-Hydrodynamics Eulerian Adaptive Mesh Refinement (AMR) code, which is widely used to perform simulations of ICF and High Energy Density Physics (HEDP) experiments.  The candidate will assist in the development of a three-dimensional laser ray-trace package, intended for use in multiple codes, and will assist in the integration of this package into the xRAGE code.  The position will also involve validation of physics models and their implementation in the xRAGE code as applied to the simulation of ICF and HEDP experiments, as well as performing detailed code comparisons.  The successful candidate is expected to work in a team environment with experimentalists and computational scientists, implement models and methods in xRAGE, and publish results. The ideal candidate will also have experience in theoretical and computational plasma physics or related disciplines.", "OrganizationName": "XCP-2/Eulerian Codes", "JobTitle": "Modeling and Simulation of Inertial Confinement Fusion Physics Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59629&p_spid=2733313&oapc=96&oas=HhHT38gkWHTV5pskPOzK6w..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59629"}, {"WhatYouWillDo": " The Detonator Science and Technology Group (Q-6) is the design authority for primary detonators on current Los Alamos nuclear weapon stockpile systems.  Q-6 provides engineering and design support to the production plants during production of War Reserve detonators, and assesses and reports on surveillance data for each stockpile detonator.  The group performs R&D on new initiation systems for future replacement stockpile system, including enhanced surety detonators.  The group also operates a detonator test laboratory, utilizing high-speed diagnostics, and supports other Los Alamos explosive test facilities in designing, deploying, and maintaining timing, firing, and integrated safety systems, as well as providing technical detonator support in fielding and executing integrated weapon experiments.This position will be filled at either the R&D Engineer 3 or R&D Engineer 4 level, depending on the skills of the selected candidate.  Additional job responsibilities (outlined below) will be assigned if the candidate is hired at the higher level.R&D Engineer 3 ($94,500 - $157,800) The successful candidate will be required to:The successful candidate will become a member of the Q-6 and assigned to one of six teams.  This may be followed by a rotation to better familiarize themselves with group activities, or direct assignment to a team including leadership of a project.  The six teams include: 1) Stockpile Systems and Surveillance 2) Detonation Science 3) Timing Firing and Firesets  4) Life Extension Programs 5) War Reserve Testing  6) Local Testing and Advanced CharacterizationThe successful candidate will team with other Q-6 engineers/scientists in such areas as:Detonator designPerformance studies and modelingDetonator testingImplementation of new diagnostics Design and qualification of firesets  The successful candidate will work with other organizations to ensure programs are supported and deliverables are met.  Strong documentation (writing) skills and ability to present technical information to a wide audience through formal and informal technical interactions are crucial in this role.  The successful candidate will work daily in a classified setting, and must demonstrate a strong commitment towards security.  Domestic/Foreign travel is periodically required based on programmatic needs.  The successful candidate will be self-motivated, with good communication, documentation, and teaming skills.  R&D Engineer 4 ($114,500 - $192,900) In addition to the duties outlined above, the R&D Engineer 4 will be required to: The successful candidate will become a member of the Q-6 and assigned to one of six teams. Once established, this will progress to leadership of a team, development and leadership of an existing project, and/or program development.  ", "OrganizationName": "Q-6/Detonation Science & Technology", "JobTitle": "R&D Engineer 3/4", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59399&p_spid=2687363&oapc=99&oas=Vl589s3yXt7qkfxdfB3FuA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59399"}, {"WhatYouWillDo": " The COSIM team seeks a postdoc to work on regional coastal climate modeling and analysis for application to climatological boundary conditions for farm-scale macroalgae modeling.  We particularly welcome research proposals for development of improved physical parameterizations corresponding to regional coastal modeling physics that impact biogeochemical processes.  With respect to simulation analyses we encourage research topics that lead to improved description and understanding of regional oceanic and BGC dynamics with a focus toward in-situ data processing and visualization.  The successful candidate will get to learn about and use regionally refined meshes for MPAS-O within the E3SM coupled modeling framework, find and use biogeochemistry (BGC) datasets for model tuning and calibration, incorporate additional model physics toward the improvement of the regional simulation (e.g., coupling a wave / sediment / sub-grid bathymetry model to MPAS-O) and evaluate model sensitivity.  Results from this work will be presented in conferences and published in peer-reviewed journals.  ", "OrganizationName": "T-3/Fluid Dynamics And Solid Mechanics", "JobTitle": "Postdoctoral Research Position for Regional Coastal Climate Modeling and Analyses", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59604&p_spid=2732308&oapc=102&oas=u8Of69Q5DY9iJ993AXCspg..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59604"}, {"WhatYouWillDo": "EES-17 is looking for a creative postdoc to join our interdisciplinary team. The successful candidate will take a role in analyzing experimental, simulation and seismic data applying machine learning techniques. A successful applicant will also have a solid background in seismology, materials science and or earthquake physics with a strong machine learning background.  Candidates should also have significant code development experience and an understanding of computational methods.  This position will require motivation to achieve in an independent work environment and also the communication skills to interact with a multidisciplinary, integrated team.  The successful applicant will have an excellent publication record in the field of materials science or geophysics; he/she will be expected to conduct research independently, publish results in peer-reviewed journals and present at conferences.  Applicants must be able to obtain a security clearance.", "OrganizationName": "EES-17/Geophysics", "JobTitle": "Post-doctoral Researcher – Machine Learning and Earthquake Slip Processes", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59626&p_spid=2733310&oapc=105&oas=TvP3wAUjD21kPWi4y54OYA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59626"}, {"WhatYouWillDo": "The Methods and Algorithms Group (XCP-4) in the Computational Physics (XCP) Division at Los Alamos National Laboratory has an opening for a scientist in theoretical and computational shock detonation physics.  The Methods and Algorithms Group (XCP-4) develops state-of-the art numerical methods for shock hydrodynamics and multimaterial flow in both Eulerian and Lagrangian framework and physics-based models for high explosive, turbulent reactive flow, and solid mechanics. Our work supports a variety of Laboratory missions, including stockpile stewardship, nonproliferation, threat reduction, and energy and environmental sciences. ", "OrganizationName": "XCP-4/Methods And Algorithms", "JobTitle": "Scientist 4/5", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59487&p_spid=2721327&oapc=108&oas=GP56-wDT1fdwNnsCtunH3Q..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59487"}, {"WhatYouWillDo": " The Plasma Theory and Application Group (XCP-6) applies theoretical and computational plasma physics to model and design novel ICF/HED experiments, theoretical models, and computational algorithms.  Areas of particular interest are: inertial confinement fusion; high energy density physics; turbulence and/or perturbed plasma flows; algorithm and model development for plasma and high energy density science. This research may lead to the design, fielding, and analysis of experiments at the Laboratory for Laser Energetics (LLE), and National Ignition Facility (NIF) lasers or on the Z machine pulsed power facility.  The successful candidate will be expected to continue fundamental or applied research in his/her areas of specialization as well as to support the national-security programs and mission of the Laboratory. ", "OrganizationName": "XCP-6/Plasma Theory And Applications", "JobTitle": "Plasma Physics Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59394&p_spid=2687358&oapc=111&oas=7kkX9WJpb0jPy6TVIS3dTg..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59394"}, {"WhatYouWillDo": " The Group of Condensed Matter and Complex Systems in the Theoretical Division of Los Alamos National Laboratory (LANL) has an immediate postdoctoral position opening in the area of theoretical modeling and simulation of strongly correlated electronic materials. This position provides an opportunity to pursue fundamental studies of electronic structure and magnetic properties in heavy fermion and related materials. The postdoctoral project will involve applications of electronic structure methods such as the combination of local density approximation (LDA) with dynamical mean-field theory (DMFT) for spectroscopic analysis and understanding. ", "OrganizationName": "T-4/Phys Of Condensed Matter & Complex Sys", "JobTitle": "Condensed Matter and Materials Physics", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59425&p_spid=2723315&oapc=114&oas=CmAquS4EhkGs1DCn7kPO7w..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59425"}, {"WhatYouWillDo": " The Methods and Algorithms Group (XCP-4) develops state-of-the art numerical methods for shock hydrodynamics and multimaterial flow in both Eulerian and Lagrangian framework and physics-based models for high explosive, turbulent reactive flow, and solid mechanics. Our work supports a variety of Laboratory missions, including stockpile stewardship, nonproliferation, threat reduction, and energy and environmental sciences.  ", "OrganizationName": "XCP-4/Methods And AlgorithmsWhere You Will Work Our diverse workforce enjoys a collegial work environment focused on creative problem solving, where everyone’s opinions and ideas are valued. We are committed to work-life balance, as well as both personal and professional growth. We consider our creative and dedicated scientific professionals to be our greatest assets, and we take pride in cultivating their talents, supporting their efforts, and enabling their successes. We provide mentoring to help new staff build a solid technical and professional foundation, and to smoothly integrate into the culture of LANL. Compensation and Benefits ·         Multiple options for work schedules·         Exercise facility free for staff use·         Choice of comprehensive medical plans·         Paid sick time and disability insurance, maternity/paternity leave·         401k (100% match up to 6% + kicker)·         Fully vested in 401k on day one·         Relocation Assistance (if needed) Los Alamos, New Mexico enjoys excellent weather, clean air, and outstanding public schools. This is a safe, low-crime, family-oriented community with frequent concerts and events as well as quick travel to many top ski resorts, scenic hiking & biking trails, and mountain climbing. The short drive to work includes stunning views of rugged canyons and mesas as well as the Sangre de Cristo mountains. Many employees choose to live in the nearby state capital, Santa Fe, which is known for world-class restaurants, art galleries, and opera. ", "JobTitle": "High Explosives Modeling and Applications Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59299&p_spid=2721320&oapc=117&oas=8bkYxAe-Sp7dbgNn6mEnsg..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59299"}, {"WhatYouWillDo": " The Inorganic, Isotope and Actinide Chemistry (C-IIAC) group is seeking an exceptional postdoctoral candidate to perform research in the area of fundamental bonding studies of the f-elements. The successful candidate will focus on the syntheses of ligands and complexes with lanthanides and actinides in pursuit of molecular moieties containing metal ions in unusual oxidation states or containing metal-ligand multiple bond character. Examples include plutonium and neptunium complexes in the +2 oxidation state, terminal oxo, sulfido groups, and imido species. The research approach requires extensive screening and synthetic protocol optimization, on small scales, with lanthanide and uranium surrogates before progressing to transuranic elements. As such, the position will entail a combination of non-radioactive reagent preparation and metal complexation testing with lanthanides/uranium, combined with extending those experiments to Np, Pu and Am transuranic elements.", "OrganizationName": "C-IIAC/Inorganic Isotope & Actinide Chem", "JobTitle": "Synthetic Inorganic Chemistry Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59077&p_spid=2723307&oapc=120&oas=hHYm6DSHoZ02fTvwerS38g..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59077"}, {"WhatYouWillDo": "HPC is seeking recent graduates looking for a challenging paid post graduate internships at the post-masters level. All selected candidates will be provided with a mentor, a challenging project for their appointment, and an opportunity to present their project work and progress to colleagues.  The projects we have to offer will vary depending on the skills and interests of the candidate and our current needs.", "OrganizationName": "HPC-DO/High Performance Computing", "JobTitle": "High Performance Computing Post Masters Intern", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59094&p_spid=2687338&oapc=123&oas=w37yFmqZGHVeRNGaoP4q_A..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59094"}, {"WhatYouWillDo": "  HPC is seeking recent graduates looking for a challenging paid post graduate internships at the post-baccalaureate level. All selected candidates will be provided with a mentor, a challenging project for their appointment, and an opportunity to present their project work and progress to colleagues.  The projects we have to offer will vary depending on the skills and interests of the candidate and our current needs.", "OrganizationName": "HPC-DO/High Performance Computing ", "JobTitle": "High Performance Computing Post Baccalaureate Intern", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59071&p_spid=2708315&oapc=126&oas=Mv3jv3OIDrquuQz-h1T66w..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59071"}, {"WhatYouWillDo": "HPC is seeking undergraduate level students looking for a challenging paid internship for the current academic year and/or summer. All selected candidates will be provided with a mentor, a challenging project for their appointment, and an opportunity to present their project work and progress to colleagues.  The student projects we have to offer will vary depending on the skills and interests of the candidate and our current needs.", "OrganizationName": "HPC-DO -High Performance Computing", "JobTitle": "High Performance Computing Upper Undergraduate Student", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59241&p_spid=2715305&oapc=129&oas=4CmuMPZ9DLlC23jkCpgicA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59241"}, {"WhatYouWillDo": "The successful candidate should have a comprehensive understanding and wide application of operational activities and systems related to the operation and maintenance of High Performance Computing (HPC) Data Centers. This includes the operation of existing data centers; involvement in the planning and determination of both design specifications and performance requirements of new or upgraded state-of-the-art data centers that will serve the growing needs of the Laboratory for modeling and simulation; safety/authorization/compliance basis; health, safety and environmental management; security; quality assurance and work control; equipment engineering; maintenance management; waste management; inventory control, materials purchasing, and packaging/ shipping/receiving activities; and document control/records management.HPC Data Center Specialist 2 ($78,400 – 128,200)Assist in the management of data centers which house the Laboratory's HPC infrastructure and supercomputing systems for the Advanced Simulation and Computing and the Institutional Computing programs.Performs routine facility or area walk-downs, procedure reviews, inspections, and/or evaluations to ensure the safe and efficient operation of the facilities.Assists in performing periodic reviews and assessments to ensure facility systems are operating properly and are being maintained within required limits.Work under guidance of more senior personnel while supporting data center electrical and mechanical systems.Assist with the analysis and issue resolution in regards to power and cooling systems serving HPC systems.Respond to facility emergencies both during normal work hours and outside of regular business hours.Coordinate equipment shutdowns, upgrades, return to service, and/or installations.Monitor the operation of electrical and mechanical equipment supporting the facility and its critical operations.Assist with the preparation and/or review of lock-out/tag-out plans that ensure specific instructions for the isolation, containment, and/or de-energization of various mechanical and electrical sources according to established procedures and facility guidelines.Perform duties consistent with LANL's commitment to a secure, safe and healthy work environment.Work will be reviewed for accuracy, soundness of judgment and overall adequacy.Work occasional weekends, holidays, and overtime as required and be \"on call\" on a rotational schedule of 24 x 7 basis.Perform basic maintenance tasks to the highest caliber, which includes: climb ladders, work in confined spaces, lift heavy objects weighing up to 50 lbs., etc.HPC Data Center Specialist 3 ($86,000 – 141,800)In addition to the duties outlined above, the HPC Data Center Specialist 3 will be required to:Investigate mechanical needs of the data centers; make recommendations for mechanical system upgrades and modifications; and assist with the implementation of those modifications. Independent judgment and latitude should be used throughout these processes/tasks.Monitor the mechanical load and prepare forecasts of future loads to ensure that building systems are adequate, reliable and meet projected computational load requirements.Provide input associated with the supercomputer request for purchasing (RFP) process.Review lock-out/tag-out plans to ensure specific instructions for the isolation, containment, and/or de-energization of various mechanical sources according to established procedures and facility guidelines.Develop optimal solutions to unique or complex problems with conflicting goals and objectives.", "OrganizationName": "HPC-DES/HPC Design", "JobTitle": "HPC Data Center Specialist 2/3", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59010&p_spid=2705314&oapc=132&oas=Nxjl91HKcdHsVFvNeDBBmA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59010"}, {"WhatYouWillDo": " HPC is seeking graduate level students looking for a challenging paid internship for the current academic year and/or summer. All selected candidates will be provided with a mentor, a challenging project for their appointment, and an opportunity to present their project work and progress to colleagues.  The student projects we have to offer will vary depending on the skills and interests of the candidate and our current needs.", "OrganizationName": "HPC/DO - High Performance Computing", "JobTitle": "High Performance Computing Graduate Intern", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59223&p_spid=2705317&oapc=135&oas=Cml8B_hGkHGgRqSJLtijkg..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59223"}, {"WhatYouWillDo": "The successful EES-14 Group Leader will serve as a member of the EES Division Leadership Team and will be expected to have a vision for the leadership of the Earth Systems Observations Group.  The EES-14 Group Leader will be responsible for strategic and tactical planning, in concert with Division leadership. He or she will be responsible for business and personnel management of the Group, including fiscal oversight, salary management, and oversight of laboratory safety and technical development of lab facilities, research program development, resource and space allocation, as well as employee evaluations and promotions.  Maintaining a strong safety and security envelope and a culture of respect for safety and security within the group is essential.  The Group Leader is expected to maintain within the Group an appropriate set of integrated capabilities to address current and emerging challenges and to participate in the development of new programs based on innovative combinations of the Group’s core competencies.  This also requires partnering with peers across the laboratory and at other institutions.  The EES-14 Group Leader will operate within the context of overall Division strategy and as an active member of the Division leadership team. The Earth Systems Observations Group (EES-14) performs primarily experimental and observational research that falls broadly across the geological, hydrological and atmospheric sciences. Areas of research include subsurface science related to rock fracturing and fluid flow in fractured reservoirs; carbon sequestration and wellbore integrity; actinide chemistry under reservoir, repository and borehole conditions of high temperature and pressure fluid; geological controls on fracturing and gas migration associated with underground nuclear explosions; geochemical tracer studies of contaminant and ore mobility in the subsurface; hydrological, geochemical and geomorphological response to regional and global climate change; monitoring and attribution of atmospheric greenhouse gases; absorbing aerosol chemistry and climate impacts; and operations and logistics for the global deployment of atmospheric radiation and climate monitoring facilities.  The Group is characterized by a balance of basic and applied research, which leads to the development of novel and integrated capabilities that are then utilized to address practical problems for a variety of sponsors in DOE, other federal agencies, and a variety of industries. Experimental facilities include a well-equipped suite of geochemical analytical labs for the characterization of rocks and fluids; high pressure experimental equipment; a rad-capable hydrothermal experimental lab; triaxle core flood with in situ tomography and a high pressure load frame for studies of rock mechanical behavior under stress; high pressure-temperature microfluidics stage; and light stable isotope mass spectrometers and peripherals. ", "OrganizationName": "EES-14/ Earth System Observations", "JobTitle": "Group Leader (R&D Manager 4)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=59081&p_spid=2687325&oapc=138&oas=o06ENsxSd6AV4QRmnOWyXw..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59081"}, {"WhatYouWillDo": "Join the team of scientists who support one of the most powerful computer centers on the planet.  Los Alamos has a legacy of stretching the boundaries of computational performance and complexity, and we are not slowing down.  From the Maniac II in 1952 through today’s hybrid processor Trinity platform, we have posted many speed records over the decades and are now driving toward Exascale.   Our High-Performance Computing Division provides production high performance computing systems services to the Laboratory. The High Performance Computing Environments group (HPC-ENV) takes responsibility for the broad range of HPC platforms, monitoring and data analytics, programming and runtime environments, software, application support and readiness, user support & services for a large and diverse customer base.  We provide support and services to many production platforms at a world class computing facility to ensure customers can accomplish their research and mission at extreme scale.   The focus for the HPC Consulting team is to support and enhance the productivity of the LANL HPC user community by providing quality technical support in a timely manner.  We achieve this by providing customer focused, single point of contact for HPC systems, services, tools and technical support.  The HPC Consulting Team provides support for all production HPC platforms in various networks, including help for programming languages, debugging, parallel computing, HPC operating systems, utilities, libraries, file systems and interconnects, scripting, archival storage, desktop backup (TSM), file transfer, HPC network, and Tri-Lab support.  The Division’s goal is to create an effective HPC environment in which scientists can be as productive as possible.  Additionally we support selected research activities that we deem important to our mission. Computing Systems Professional 1 (CSP-1) ($59,100 - $93,800) The successful candidate will be required to: ·         Provide tier 1 customer support as part of the Consulting Office within HPC-ENV to scientific users under the supervision and mentorship of senior HPC Consultants·         Participate in the weekly consult support schedule by answering questions, solving technical problems by telephone, electronic mail, and in person·         Interact with end-users and the HPC user support teams.·         Communicating and collaborating frequently with customers and with HPC teams·         Provide storage support for customers using the current backup solution Computing Systems Professional 2 (CSP-2)  ($71,000 - $115,700) In addition to the duties outlined above, the CSP-2 will be required to:·         Contribute to technical HPC documentation and presentations ·         Responsible for a variety of shorter term issue while steadily increasing responsibilities as knowledge of our environment and HPC systems increases·         Participate in process improvement and resolution in coordination with other Consultants and HPC Teams.·         Propose and implement solutions when presented with projects in our HPC environment. Computing Systems Professional 3 (CSP-3) ($86,000 - $141,800) In addition to the duties outlined above, the CSP-3 will be required to:·         Provide in-depth customer support as part of the Consulting Team within HPC-ENV to scientific users in the areas of programming languages, operating systems, storage, libraries, utilities, code performance and other facets of the HPC environment·         Work independently and responsible for taking on a range of issues from short to medium term issues·         Communicating and collaborating frequently with customers, other cross-Group and cross-Division teams as well as other HPC sites·         Provide technical and professional expertise to students or junior staff through mentoring and training ", "OrganizationName": "HPC-ENV/HPC Environments", "JobTitle": "Computing Systems Professional 1/2/3", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=58696&p_spid=2687320&oapc=141&oas=njtHS077M79P_BPt9cN_nQ..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58696"}, {"WhatYouWillDo": "The Applied Modern Physics Group (P-21), within Physics Division and the Associate Directorate for Experimental Physical Science, seeks a half-time Deputy Group Leader (DGL) to team with the Group Leader (GL) and administrative staff in management and leadership of our scientific portfolio and administrative operations.  P-21 is directly engaged in the lab’s primary mission though stewardship and analysis of legacy nuclear test data, radiographic image analysis of hydrotest and subcritical experiments, and weapons diagnostic development.  We are tightly partnered with the Dual Axis Radiographic Hydrotest Facility (DARHT) at LANL, and with radiographic facilities across the nation and world.  P-21 also conducts fundamental and applied research in quantum science and engineering, experimental and computational neuroscience, ultra-sensitive magnetic sensing, microfluidics, and instrument miniaturization, bio-security and medical imaging.  A successful candidate for this position will support the GL in managing P-21’s scientific and programmatic portfolio, maintaining and refining the long-range Group vision and mission, and in developing new programs in support of Physics Division, ADEPS, and LANL goals.  Duties include human resource management and career development, budget and resource management, program and partnership development, strategic planning, communication within and outside the Group, operational management with particular attention to safety and security, and promotion of diversity, observance of AA/EEO policies and maintenance of a positive work environment.  The DGL will assist in guiding all of these activities and take lead responsibility for strengthening at least one portion of the group’s research and/or programmatic work, or expanding the group’s portfolio to include complementary research.This is nominally a half-time position, so the successful candidate will be expected to also contribute technical activities that add value to P-21. This may be through application of unique knowledge of program requirements in a program management or project management position, or through participation in one or more research and development or programmatic projects within the group.", "OrganizationName": "P-21/ Applied Modern Physics", "JobTitle": "P-21 Deputy Group Manager (R&D Manager 3)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=58862&p_spid=2697306&oapc=144&oas=hr9O1dZlAJqz0R6rY9rWhw..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58862"}, {"WhatYouWillDo": "Come join the best and brightest minds in the world at one of the most innovative and creative multidisciplinary research institutions engaged in strategic science on behalf of national security. The work we do at Los Alamos National Laboratory (LANL) matters to our country and the world.  The positions is advertised at the Scientist 2 and 3 level with the Scientist 2 equivalent to assistant professor level in academia and the Scientist 3 corresponding to associate professor in academia.LANL is seeking an exceptional computational and theoretical biophysicist with a strong background in theory and track record of extraordinary achievement to join the Theoretical Biology and Biophysics Group in T-Division. The successful candidate will have a demonstrated track record of high quality scientific productivity, as indicated by a significant publication record, invited talks, and professional recognition.  Demonstrated ability to perform trans disciplinary research is essential, and the flexibility to engage in both basic and applied research, is required. Relevant areas of experience include the development of methods for molecular dynamics simulations, such as enhanced sampling methods, free-energy calculations, or statistical approaches for analyzing large data sets.  Scientist 2 ($86,000-$141,800)The successful candidate will be required to:Perform independent research in basic and/or applied research related to human diseases from the molecular to the cellular to within host levels to gain fundamental understanding of disease and treatment.Engage the vibrant intellectual community in the Theoretical Biology and Biophysics group, the Theoretical Division, and the broader LANL research community to contribute to existing research programsActively seek opportunities to attract potential sponsors, both within and outside LANL, to develop independently funded researchEstablish collaborations with experimental laboratories and the ability to exploit data collected by other entities to support modeling and simulations.  Contribute to existing projects that require multiscale modeling of large biomolecular systems in complex, heterogeneous environments. Scientist 3 Title ($94,500-$157,800)In addition to the duties outlined above, the (higher level title) will be required to:Mentor postdoctoral fellows and, possibly, students Be engaged in the national and international scientific community in theoretical biology and biophysicsSets direction and goals for well-defined tasks and deliverables involving more than one person", "OrganizationName": "T-6 / Theoretical Biology And Biophysics", "JobTitle": "Scientist 2/3", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=58666&p_spid=2686310&oapc=147&oas=JTT-24sxdsl7738IJp13rw..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58666"}, {"WhatYouWillDo": "X-Theoretical Design (XTD) division members are the scientific stewards of the U.S. nuclear stockpile, applying theoretical and computational physics to the performance and safety of nuclear weapons. XTD scientists also contribute their expertise to the nation’ sforeign threat assessment, counter-proliferation and non-proliferation efforts through assessment of foreign devices, design of tools to address nuclear emergency response scenarios, and creation of solutions to inhibit nuclear proliferation. In addition, XTD scientists drive cutting edge advances in astrophysics, geophysics, high energy density physics, inertial confinement fusion, chemistry, and material science. Members of XTD use multi-physics codes, running on some of the world’s fastest supercomputers, to create and analyze simulations of very complex systems. We work closely with many other organizations in a diverse variety of tasks, including experimental design and analysis, model development, code validation, and project leadership. The selected candidate will:Demonstrate a thorough knowledge of and capability with large, multi-physics codes. Apply multi-physics codes to solve problems of national security interest, exercising personal initiative to guide your own and others’ efforts.Contribute to one or more of the related tasks: contributing to experimental design and analysis, coordinate with model development efforts, project leadership, data evaluation, and code validation.Contribute leadership skills to team efforts. Contribute to organizational knowledge level by mentoring others.Continue to expand your technical knowledge.Demonstrate generalist capabilities in solving problems.Work with a wide variety of colleagues with varying backgrounds on research covering multiple physics areas in order to solve difficult problems.Demonstrate and maintain excellence in communication, both written and verbal. ", "OrganizationName": "XTD-DO/X Theoretical Design", "JobTitle": "Theoretical Design Scientist (Scientist 3)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=58682&p_spid=2687306&oapc=150&oas=vs8lf8435Se8Lvw8vn-P2w..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58682"}, {"WhatYouWillDo": " The Center for Theoretical Astrophysics (CTA) is seeking candidates for one or more postdoctoral positions in computational astrophysics, particularly in topics relating to:·         Cosmology calculations using a broad range of tools, focused on studying the formation of the first stars and black holes;·         Evolution of massive black holes, studying both radiation and magneto-hydrodynamic effects;·         Star and planet formation;·         Engines of thermonuclear and core-collapse supernovae, gamma-ray bursts, and x-ray bursts;·         Understanding the behavior of matter at nuclear densities and applying these effects (neutrinos, equations of state) to supernova models;·         Nucleosynthetic yields from stars and supernovae, nuclear cross-sections (tying to experiment), and galactic chemical evolution;·         Following supernovae through the remnant phase, including effects of NLTE opacities and magneto-hydrodynamics;·         Modeling spectra and light-curves from transients, including radiation-hydrodynamic effects and atomic physics;·         Generation and propagation of cosmic rays from gamma-ray bursts and supernovae, with ties to a number of missions such as HAWC and NuSTAR;·         Asteroid impacts and planetary physics.The CTA additionally has ties to various experimental astrophysics groups, leveraging expertise in plasma physics, turbulence, radiation transport, nuclear physics, and atomic physics. ", "OrganizationName": "Center for Theoretical Astrophysics", "JobTitle": "Computational Astrophysics Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=58662&p_spid=2686306&oapc=153&oas=tKrr6qkdrFBA3sDY_TkwNA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58662"}, {"Location": "Los Alamos, NM, US", "JobTitle": "High-Energy Astophysics Postdoc", "OrganizationName": "T-2/Nuc & Particle Phys, Astrophys & Cosmol Outstanding candidates are invited to apply for an immediate postdoc opening in the high-energy astrophysics. We seek candidates with background in radiative processes, particle acceleration, and jets/outflows from compact objects. Experiences in theoretical and computational astrophysics are highly desirable. The successful candidates are encouraged to collaborate on the current projects carried out at LANL, including with the HAWC observation team, and they will also be able to develop his/her own research programs. The initial appointment is for two years, with a possible third year extension. In addition to applying on-line, candidates should send their applications electronically, including a CV, publication list, and a concise research statement (within 2 pages) describing past achievements and future plans. Applicants should arrange three reference letters to be sent electronically as well. All material and further inquiries can be sent to Hui Li (hli@lanl.gov), Fan Guo (guofan@lanl.gov) and Shengtai Li (sli@lanl.gov).  The position is offered by the Nuclear and Particle Physics, Astrophysics and Cosmology group within the Theoretical Division at Los Alamos National Laboratory. Outstanding candidates may also be considered for a Director's Fellowship as well as the distinguished fellowships such as the Marie Curie, Richard P. Feynman, J. Robert Oppenheimer, or Frederick Reines Fellowships. Applicants with US citizenship will also be considered for the Metropolis Postdoctoral Fellowship in Computational Physics. Applications must be received before Oct. 1, 2017 for full consideration. The review of applications will be on-going until offers are accepted.  Education:  PhD in related fields completed within the past five years or soon to be completed. Additional Details: Position does not require a security clearance.  Selected candidates will be subject to drug testing and other pre-employment background checks.New-Employment Drug Test: The Laboratory requires successful applicants to complete a new-employment drug test and maintains a substance abuse policy that includes random drug testing. Benefits and Other Info:  For general information to the Postdoc Program (such as salary, benefits, eligibility, appointment types), please go to http://www.lanl.gov/careers/career-options/postdoctoral-research/postdoc-program/index.php Equal Opportunity: Los Alamos National Laboratory is an equal opportunity employer and supports a diverse and inclusive workforce. All employment practices are based on qualification and merit, without regards to race, color, national origin, ancestry, religion, age, sex, gender identity, sexual orientation or preference, marital status or spousal affiliation, physical or mental disability, medical conditions, pregnancy, status as a protected veteran, genetic information, or citizenship within the limits imposed by federal laws and regulations.  The Laboratory is also committed to making our workplace accessible to individuals with disabilities and will provide reasonable accommodations, upon request, for individuals to participate in the application and hiring process. To request such an accommodation, please send an email to applyhelp@lanl.gov or call 1-505-665-4444 option 1.Where You Will Work Located in northern New Mexico, Los Alamos National Laboratory (LANL) is a multidisciplinary research institution engaged in strategic science on behalf of national security.  LANL enhances national security by ensuring the safety and reliability of the U.S. nuclear stockpile, developing technologies to reduce threats from weapons of mass destruction, and solving problems related to energy, environment, infrastructure, health, and global security concerns.Appointment TypePostdocPostdocMinimum SalaryMaximum Salary", "VacancyNumber": "IRC58600", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1519027264&retainAM=N&addBreadCrumb=RP&p_svid=58600&p_spid=2683304&oapc=156&oas=xMj-3yDsaAR_dgoTAFAd0Q.."}]}}