{"jobs": {"hpc": [{"WhatYouWillDo": "  High performance computing is a powerful tool that when put into the hands of creative minds is helping humanity solve its hardest problems.  Supercomputers help us see structure in the chaos, find signals in the noise, and turn trillions of data points into answers to unlock radical innovation.  The High Performance Computing (HPC) Platforms Team provides vanguard system and runtime support for some of the largest and fastest supercomputers in the world, including multi-petaop systems (e.g., the recently deployed 40 Peta operations per second Trinity Supercomputer). Troubleshooters and problem-solvers at heart, the HPC Platforms Team seeks highly motivated, productive, inquisitive, and multi-talented candidates who are equally comfortable working independently as well as part of a team.  The successful applicant will acquire the skills needed to take a leading role in working on all aspects of LANL’s HPC cluster administration.  A broad range of expertise and background is desired in the team, and there are multiple projects that a successful candidate can pursue within the production and research disciplines of the team.  There are frequent opportunities for collaborative work with scientists and staff within the group (for instance with scientists designing and operating our high-speed networks or data storage infrastructure) or with scientists from other groups, including close collaborative research opportunities with LANL’s Ultrascale Systems Research Center (USRC), to help drive cutting edge advances.This role requires strong communication skills, as well as comprehensive troubleshooting and analytical skills.  Team member duties include: system deployment, configuration, and full system administration of LANL’s world-class compute clusters; evaluating and testing new technology and solutions; diagnosing, solving, and implementing solutions for various system operational problems; system administration of HPC network infrastructure in support of compute clusters; diagnosing, solving, and implementing solutions for various system operational problems; system software management and maintenance, including security posture maintenance; tuning operating systems to increase performance and reliability of services; developing tools to support automation, optimization and monitoring efforts; interacting with vendors; and communicating and collaborating with other groups, teams, projects and sites.The selected candidate will participate in a regularly scheduled rotation of on-call support of production systems, including some systems under 7x24 hour support.  In addition, some non-standard working hours may occasionally be required. This position is full-time and is located at Los Alamos National Laboratory in Los Alamos, New Mexico.  This position will be filled at either the Scientist 2 or Scientist 3 level, depending upon the skills of the selected candidate.  Additional job responsibilities (outlined below) will be assigned if the candidate is hired at the higher level.Scientist 2 ($86,000-$141,800) ·           Participate in periodic on‐call responsibilities.·           Work both independently and collaboratively with other system administrators, as well as under the supervision and guidance of senior HPC system administrators to provide technical assistance in problem solving, configuration management, and day-to-day operation of various supercomputing systems.·           Troubleshoot, diagnose root cause, and isolate the components / failure scenarios while working with internal & external stakeholders.·           Participate in process improvement, including deep multi‐system problem isolation and resolution often in collaboration with administrators of other HPC subsystems. ·           Develop and publish updates on resolutions and communicate findings internally.·           Work with team members to make modifications and additions to existing code, methods and procedures.·           Work with team to bring up new hardware and test functionality.·           Work with team members and vendors to document, design, and implement new ideas and approaches for newer system administration and configuration tools and strategies and improve those for existing ones. ·           Present best practices, experience reports, and/or research results to managers and to peers locally or at conferences.  Scientist 3 ($94,500-$157,800)In addition to the duties outlined above, a successful Scientist 3 candidate will be required to:Work as a technical leader/subject matter expert to propose and implement solutions to current problems and future deficiencies in our HPC networking environment in conjunction with junior and senior administrators and technical staff within and across teams. Proactively create experiments and tooling to validate solutions and to detect and diagnose network and hardware health issues.Analyze published research papers in the area of networking and high-speed interconnects, summarize, and share implications and connections to ongoing work with team members.Interact and/or collaborate with people from other teams, groups, divisions, directorates, and programs to develop, implement, and/or communicate technical solutions.Mentor junior technical staff and students.Present best practices and research results to national peers at conferences, workshops, and meetings, as well as participate in national strategic partnerships. ", "OrganizationName": "HPC-SYS/ Computing Operations & SupportDo the most meaningful work of your careerCome join the best and brightest minds in the world at one of the most innovative and creative multidisciplinary research institutions engaged in strategic science on behalf of U.S. national security.  The work that we do at Los Alamos National Laboratory (LANL) matters to our country and the world.Make a differenceAt LANL, we’re determined to harness science and imagination to make the world a better and safer place by solving complex problems others can’t.  In LANL’s High Performance Computing Division, we are pushing the computing pendulum, designing the future, and empowering scientists across the national laboratory to make an impact.  When you’re in charge of making a difference, there’s no limit to what you can do. Work/Life Balance Our diverse workforce enjoys a collegial work environment focused on creative problem solving, where everyone’s opinions and ideas are valued. We are committed to work-life balance, as well as both personal and professional growth. We consider our creative and dedicated scientific professionals to be our greatest assets, and we take pride in cultivating their talents, supporting their efforts, and enabling their successes. We provide mentoring to help new staff build a solid technical and professional foundation, and to smoothly integrate into the culture of LANL. Compensation and Benefits include:Multiple options for work schedulesExercise facility free for staff useChoice of comprehensive medical plansPaid sick time and disability insurance401k (100% match up to 6% + kicker)Fully vested in 401k on day oneRelocation Assistance (if needed)Los Alamos, New Mexico enjoys excellent weather, clean air, and outstanding public schools. This is a safe, low-crime, family-oriented community with frequent concerts and events as well as quick travel to many top ski resorts, scenic hiking & biking trails, and mountain climbing. The short drive to work includes stunning views of rugged canyons and mesas as well as the Sangre de Cristo mountains. Many employees choose to live in the nearby state capital, Santa Fe, which is known for world-class restaurants, art galleries, and opera. ", "JobTitle": "HPC Cluster Administrator (Scientist 2/3)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1582812031&retainAM=N&addBreadCrumb=RP&p_svid=59224&p_spid=2705318&oapc=21&oas=CymcnSgEOgfdNqeDEEf_IA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59224"}, {"WhatYouWillDo": "The High Performance Computing (HPC) Division at Los Alamos National Laboratory provides scientific computing resources consisting of some of the largest HPC systems in the world. The Systems team within the HPC Design Group (HPC-DES) is responsible for defining the technical direction, evaluating, developing and deploying the tools and system software ultimately used in production support of LANL’s HPC resources. These HPC resources are some of the largest in the world and currently include a large (19K+ node) Cray system called Trinity as well as numerous large commodity cluster systems.  This position will be filled at the Scientist 3 or 4 level as dictated by current programmatic needs and the skills of the selected candidate. Job responsibilities will be assigned in accordance with the level at which the selected candidate is hired. We are targeting this position to provide technical leadership and direction with the goal of providing a scalable, usable, maintainable HPC user software environment, with a focus on system job scheduling, application development and runtime environment, monitoring and data analytics. You will be working closely with other DES System team members as well as more production focused team members in other groups at the HPC division.  Projects typically involve collaborations inside and outside of the Laboratory, in line with the Laboratories’ history of leadership in HPC. Some non-standard working hours may occasionally be required. HPC-DES invites applicants for a position of Scientist 3 or 4 to join the DES Systems Software team.  We seek candidates who want to make significant contributions at the local HPC division and ultimately impact HPC technical direction at LANL and across the DOE and the nation.  This position will be filled at either the Scientist 3 or Scientist 4 level, depending on the skills of the selected candidate.  Additional job responsibilities (outlined below) will be assigned if the candidate is hired at the higher level. Scientist 3 ($94,500 - $157,800)The successful candidate will be required to:Work as a technical leader to propose and implement solutions to current problems and future deficiencies in our HPC environment in conjunction with junior and senior administrators and technical members of other HPC teams. As mentioned above, the focus areas for this individual will be system job scheduling, application development and runtime environment, monitoring and data analytics.Assist in the setup, administration and maintenance of various HPC test and evaluation servers for prototype and evaluation use in HPC user software environment. Troubleshoot complicated user job issues that cross multiple technical areas including job scheduling, user environment, and system software stack. Implement active network security monitoring technologies.Evaluate, architect, test and implement expanded job scheduling features, potentially including power management, job throughput, power efficiency and other advanced features.Deploy advanced analytics tools or machine learning techniques on monitoring data for use in our production environment. Communicate the strategies and successes of HPC Division to national peers and participate in national strategic partnerships. Scientist 4 ($114,500 - $192,900)In addition to the duties outlined above, the Scientist 4 will be required to:Develop, propose, defend, and ultimately impact system hardware and software architecture HPC user software environment requirements for next generation HPC systems.Enhance technical and professional expertise of junior and other staff through mentoring and training.Successfully collaborate with potential end users of our monitoring system data and analytics to better define requirements and use cases. Rapidly implement prototype environments for user feedback and suggestions.Lead process improvement and deep multi‐system problem isolation and resolution in coordination with administrators of other HPC subsystems.", "OrganizationName": "HPC-DES/HPC Design", "JobTitle": "HPC-DES System Developer (Scientist 3/4)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1582812031&retainAM=N&addBreadCrumb=RP&p_svid=58694&p_spid=2687318&oapc=24&oas=nU2-tlRFBxF2EDs_TQBHow..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58694"}, {"WhatYouWillDo": "HPC is seeking recent graduates looking for a challenging paid post graduate internships at the post-masters level. All selected candidates will be provided with a mentor, a challenging project for their appointment, and an opportunity to present their project work and progress to colleagues.  The projects we have to offer will vary depending on the skills and interests of the candidate and our current needs.", "OrganizationName": "HPC-DO/High Performance Computing", "JobTitle": "High Performance Computing Post Masters Intern", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1582812031&retainAM=N&addBreadCrumb=RP&p_svid=59094&p_spid=2687338&oapc=27&oas=-pxOgjJPD4mk9viCBrBi8g..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59094"}, {"WhatYouWillDo": "  HPC is seeking recent graduates looking for a challenging paid post graduate internships at the post-baccalaureate level. All selected candidates will be provided with a mentor, a challenging project for their appointment, and an opportunity to present their project work and progress to colleagues.  The projects we have to offer will vary depending on the skills and interests of the candidate and our current needs.", "OrganizationName": "HPC-DO/High Performance Computing ", "JobTitle": "High Performance Computing Post Baccalaureate Intern", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1582812031&retainAM=N&addBreadCrumb=RP&p_svid=59071&p_spid=2708315&oapc=30&oas=troHFJhKcqXJndD8L0QNAg..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59071"}, {"WhatYouWillDo": "HPC is seeking undergraduate level students looking for a challenging paid internship for the current academic year and/or summer. All selected candidates will be provided with a mentor, a challenging project for their appointment, and an opportunity to present their project work and progress to colleagues.  The student projects we have to offer will vary depending on the skills and interests of the candidate and our current needs.", "OrganizationName": "HPC-DO -High Performance Computing", "JobTitle": "High Performance Computing Upper Undergraduate Student", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1582812031&retainAM=N&addBreadCrumb=RP&p_svid=59241&p_spid=2715305&oapc=33&oas=5WcJ8ij1w5kACCYrIpoY7w..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59241"}, {"WhatYouWillDo": "The successful candidate should have a comprehensive understanding and wide application of operational activities and systems related to the operation and maintenance of High Performance Computing (HPC) Data Centers. This includes the operation of existing data centers; involvement in the planning and determination of both design specifications and performance requirements of new or upgraded state-of-the-art data centers that will serve the growing needs of the Laboratory for modeling and simulation; safety/authorization/compliance basis; health, safety and environmental management; security; quality assurance and work control; equipment engineering; maintenance management; waste management; inventory control, materials purchasing, and packaging/ shipping/receiving activities; and document control/records management.HPC Data Center Specialist 2 ($78,400 – 128,200)Assist in the management of data centers which house the Laboratory's HPC infrastructure and supercomputing systems for the Advanced Simulation and Computing and the Institutional Computing programs.Performs routine facility or area walk-downs, procedure reviews, inspections, and/or evaluations to ensure the safe and efficient operation of the facilities.Assists in performing periodic reviews and assessments to ensure facility systems are operating properly and are being maintained within required limits.Work under guidance of more senior personnel while supporting data center electrical and mechanical systems.Assist with the analysis and issue resolution in regards to power and cooling systems serving HPC systems.Respond to facility emergencies both during normal work hours and outside of regular business hours.Coordinate equipment shutdowns, upgrades, return to service, and/or installations.Monitor the operation of electrical and mechanical equipment supporting the facility and its critical operations.Assist with the preparation and/or review of lock-out/tag-out plans that ensure specific instructions for the isolation, containment, and/or de-energization of various mechanical and electrical sources according to established procedures and facility guidelines.Perform duties consistent with LANL's commitment to a secure, safe and healthy work environment.Work will be reviewed for accuracy, soundness of judgment and overall adequacy.Work occasional weekends, holidays, and overtime as required and be \"on call\" on a rotational schedule of 24 x 7 basis.Perform basic maintenance tasks to the highest caliber, which includes: climb ladders, work in confined spaces, lift heavy objects weighing up to 50 lbs., etc.HPC Data Center Specialist 3 ($86,000 – 141,800)In addition to the duties outlined above, the HPC Data Center Specialist 3 will be required to:Investigate mechanical needs of the data centers; make recommendations for mechanical system upgrades and modifications; and assist with the implementation of those modifications. Independent judgment and latitude should be used throughout these processes/tasks.Monitor the mechanical load and prepare forecasts of future loads to ensure that building systems are adequate, reliable and meet projected computational load requirements.Provide input associated with the supercomputer request for purchasing (RFP) process.Review lock-out/tag-out plans to ensure specific instructions for the isolation, containment, and/or de-energization of various mechanical sources according to established procedures and facility guidelines.Develop optimal solutions to unique or complex problems with conflicting goals and objectives.", "OrganizationName": "HPC-DES/HPC Design", "JobTitle": "HPC Data Center Specialist 2/3", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1582812031&retainAM=N&addBreadCrumb=RP&p_svid=59010&p_spid=2705314&oapc=36&oas=apgHOht5uAGBPYl_8MEmPA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59010"}, {"WhatYouWillDo": " HPC is seeking graduate level students looking for a challenging paid internship for the current academic year and/or summer. All selected candidates will be provided with a mentor, a challenging project for their appointment, and an opportunity to present their project work and progress to colleagues.  The student projects we have to offer will vary depending on the skills and interests of the candidate and our current needs.", "OrganizationName": "HPC/DO - High Performance Computing", "JobTitle": "High Performance Computing Graduate Intern", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1582812031&retainAM=N&addBreadCrumb=RP&p_svid=59223&p_spid=2705317&oapc=39&oas=nRkSn19IBxOGIJltx_Ao-Q..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC59223"}, {"WhatYouWillDo": "Join the team of scientists who support one of the most powerful computer centers on the planet.  Los Alamos has a legacy of stretching the boundaries of computational performance and complexity, and we are not slowing down.  From the Maniac II in 1952 through today’s hybrid processor Trinity platform, we have posted many speed records over the decades and are now driving toward Exascale.   Our High-Performance Computing Division provides production high performance computing systems services to the Laboratory. The High Performance Computing Environments group (HPC-ENV) takes responsibility for the broad range of HPC platforms, monitoring and data analytics, programming and runtime environments, software, application support and readiness, user support & services for a large and diverse customer base.  We provide support and services to many production platforms at a world class computing facility to ensure customers can accomplish their research and mission at extreme scale.   The focus for the HPC Consulting team is to support and enhance the productivity of the LANL HPC user community by providing quality technical support in a timely manner.  We achieve this by providing customer focused, single point of contact for HPC systems, services, tools and technical support.  The HPC Consulting Team provides support for all production HPC platforms in various networks, including help for programming languages, debugging, parallel computing, HPC operating systems, utilities, libraries, file systems and interconnects, scripting, archival storage, desktop backup (TSM), file transfer, HPC network, and Tri-Lab support.  The Division’s goal is to create an effective HPC environment in which scientists can be as productive as possible.  Additionally we support selected research activities that we deem important to our mission. Computing Systems Professional 1 (CSP-1) ($59,100 - $93,800) The successful candidate will be required to: ·         Provide tier 1 customer support as part of the Consulting Office within HPC-ENV to scientific users under the supervision and mentorship of senior HPC Consultants·         Participate in the weekly consult support schedule by answering questions, solving technical problems by telephone, electronic mail, and in person·         Interact with end-users and the HPC user support teams.·         Communicating and collaborating frequently with customers and with HPC teams·         Provide storage support for customers using the current backup solution Computing Systems Professional 2 (CSP-2)  ($71,000 - $115,700) In addition to the duties outlined above, the CSP-2 will be required to:·         Contribute to technical HPC documentation and presentations ·         Responsible for a variety of shorter term issue while steadily increasing responsibilities as knowledge of our environment and HPC systems increases·         Participate in process improvement and resolution in coordination with other Consultants and HPC Teams.·         Propose and implement solutions when presented with projects in our HPC environment. Computing Systems Professional 3 (CSP-3) ($86,000 - $141,800) In addition to the duties outlined above, the CSP-3 will be required to:·         Provide in-depth customer support as part of the Consulting Team within HPC-ENV to scientific users in the areas of programming languages, operating systems, storage, libraries, utilities, code performance and other facets of the HPC environment·         Work independently and responsible for taking on a range of issues from short to medium term issues·         Communicating and collaborating frequently with customers, other cross-Group and cross-Division teams as well as other HPC sites·         Provide technical and professional expertise to students or junior staff through mentoring and training ", "OrganizationName": "HPC-ENV/HPC Environments", "JobTitle": "Computing Systems Professional 1/2/3", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1582812031&retainAM=N&addBreadCrumb=RP&p_svid=58696&p_spid=2687320&oapc=42&oas=X4_cR8p9YS5xMcbDQJufLw..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58696"}, {"WhatYouWillDo": " High performance computing is a powerful tool that when put into the hands of creative minds is helping humanity solve its hardest problems.  Supercomputers help us see structure in the chaos, find signals in the noise, and turn trillions of data points into answers to unlock radical innovation.  The High Performance Computing (HPC) Networking Team provides vanguard production support, research, and development for existing and future high speed networks and interconnects that feed and unleash the power of the supercomputer.  The Networking Team designs, builds and maintains some of the largest, fastest, and secure networks for both data movement and system capability in the world, including systems supporting up to 100 Gigabit per second of throughput and continuing to grow.  We provide network technology spanning the full range of tiers from campus networks to highest speed cluster interconnects for some of the largest and fastest supercomputers in the world. The HPC Networking Team is responsible for all aspects of networking within the HPC environment across three separate networks.  This includes Ethernet, InfiniBand, and Omni-Path networks used within more than a dozen high performance computing resources.  This also includes significantly complex Ethernet networks that control and manage access between the clusters and external resources. The successful candidate will support design, deployment, and maintenance efforts for networks within the HPC environment.  Builders and problem-solvers at heart, the HPC Networking Team seeks highly motivated, productive, inquisitive, and multi-talented candidates who are equally comfortable working independently as well as part of a team.  The successful applicant will acquire the skills needed to take a leading role in working on all aspects of LANL’s HPC networking infrastructure.  A broad range of expertise and background is desired in the team, and there are multiple projects that a successful candidate can pursue within the production and research disciplines of the team.  There are frequent opportunities for collaborative work with scientists and staff within the group (for instance with scientists designing and operating our high-speed data storage infrastructure) or with scientists from other groups, including close collaborative research opportunities with LANL’s Ultrascale Systems Research Center (USRC), to help drive cutting edge advances. This role requires strong communication skills, as well as comprehensive troubleshooting and analytical skills.  Team member duties include: designing, building, and maintaining world-class data movement and storage networks, which includes HPC network core, file system connectivity, and computing interconnects; evaluating and testing new technology and solutions; system administration of HPC network infrastructure in support of compute clusters; diagnosing, solving, and implementing solutions for various system operational problems; Troubleshooting issues, management/maintenance of all routing and switch infrastructure within HPC compute clusters; developing tools to support automation, optimization and monitoring efforts; interacting with vendors; and communicating and collaborating with other groups, teams, projects and sites. The selected candidate will participate in a regularly scheduled rotation of on-call support of production systems, including some systems under 7x24 hour support.  In addition, some non-standard working hours may occasionally be required. This position is full-time and is located at Los Alamos National Laboratory in Los Alamos, New Mexico.   This position will be filled at either the Scientist 2 or Scientist 3 level, depending upon the skills of the selected candidate. Additional job responsibilities (outlined below) will be assigned if the candidate is hired at the higher level. Scientist 2 ($86,000-$141,800)Participate in periodic on-call responsibilities.Work both independently and collaboratively with other members of the team or group after receiving initial direction and requirements from technical project leads.Troubleshoot, diagnose root cause of network failures, and isolate the components / failure scenarios while working with internal & external stakeholders.Contributing to the physical deployment or relocation of HPC network and/or interconnect cabling and hardware.Develop and publish updates on resolutions and communicate findings internally.Work with team members to make modifications and additions to existing networks, methods and procedures.Work with team to bring up new hardware and test functionality.Participate in process improvement, including deep multi‐system problem isolation and resolution often in collaboration with administrators of other HPC subsystems. Work with team members and vendors to document, design, and implement new ideas and approaches for newer network topologies and improve those for existing ones. Present best practices, experience reports, and/or research results to managers and to peers locally or at conferences. Scientist 3 ($94,500-$157,800)In addition to the duties outlined above, a successful Scientist 3 candidate will be required to:Work as a technical leader/subject matter expert to propose and implement solutions to current problems and future deficiencies in our HPC networking environment in conjunction with junior and senior administrators and technical staff within and across teams. Proactively create experiments and tooling to validate solutions and to detect and diagnose network and hardware health issues.Analyze published research papers in the area of networking and high-speed interconnects, summarize, and share implications and connections to ongoing work with team members.Interact and/or collaborate with people from other teams, groups, divisions, directorates, and programs to develop, implement, and/or communicate technical solutions.Mentor junior technical staff and students.Present best practices and research results to national peers at conferences, workshops, and meetings, as well as participate in national strategic partnerships.", "OrganizationName": "HPC-SYS/HPC Systems Do the most meaningful work of your careerCome join the best and brightest minds in the world at one of the most innovative and creative multidisciplinary research institutions engaged in strategic science on behalf of U.S. national security.  The work that we do at Los Alamos National Laboratory (LANL) matters to our country and the world. Make a differenceAt LANL, we’re determined to harness science and imagination to make the world a better and safer place by solving complex problems others can’t.  In LANL’s High Performance Computing Division, we are pushing the computing pendulum, designing the future, and empowering scientists across the national laboratory to make an impact.  When you’re in charge of making a difference, there’s no limit to what you can do. Work/Life Balance Our diverse workforce enjoys a collegial work environment focused on creative problem solving, where everyone’s opinions and ideas are valued. We are committed to work-life balance, as well as both personal and professional growth. We consider our creative and dedicated scientific professionals to be our greatest assets, and we take pride in cultivating their talents, supporting their efforts, and enabling their successes. We provide mentoring to help new staff build a solid technical and professional foundation, and to smoothly integrate into the culture of LANL. Compensation and Benefits include:Multiple options for work schedulesExercise facility free for staff useChoice of comprehensive medical plansPaid sick time and disability insurance401k (100% match up to 6% + kicker)Fully vested in 401k on day oneRelocation Assistance (if needed)Los Alamos, New Mexico enjoys excellent weather, clean air, and outstanding public schools. This is a safe, low-crime, family-oriented community with frequent concerts and events as well as quick travel to many top ski resorts, scenic hiking & biking trails, and mountain climbing. The short drive to work includes stunning views of rugged canyons and mesas as well as the Sangre de Cristo mountains. Many employees choose to live in the nearby state capital, Santa Fe, which is known for world-class restaurants, art galleries, and opera.  ", "JobTitle": "HPC Network Administrator (Scientist 2/3)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1582812031&retainAM=N&addBreadCrumb=RP&p_svid=58698&p_spid=2687322&oapc=45&oas=haMNHLB7GIwdIz3ZpZaYAA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58698"}, {"WhatYouWillDo": "  High performance computing is a powerful tool that when put into the hands of creative minds is helping humanity solve its hardest problems.  Supercomputers help us see structure in the chaos, find signals in the noise, and turn trillions of data points into answers to unlock radical innovation.  The High Performance Computing (HPC) Data Storage Team provides vanguard production support, research, and development for existing and future systems that feed and unleash the power of the supercomputer.  The Data Storage Team designs, builds and maintains some of the largest, fastest and most complex data movement and storage systems in the world, including systems supporting 100 Petabytes of capacity.  We provide storage systems spanning the full range of tiers from the most resilient archival systems to the pinnacle of high-speed storage, including all-flash file systems and systems supplying bandwidth that exceeds a terabyte per second to some of the largest and fastest supercomputers in the world. Innovators and builders at heart, the Data Storage team seeks highly motivated, productive, inquisitive, and multi-talented candidates who are equally comfortable working independently as well as part of a team.  The successful applicant will acquire the skills needed to take a leading role in working on all aspects of LANL’s HPC data movement and storage infrastructure.  A broad range of expertise and background is desired in the team, and there are multiple projects that a successful candidate can pursue within the production and research disciplines of the team.  There are frequent opportunities for collaborative work with scientists and staff within the group (for instance with scientists designing and operating our high-speed networking infrastructure) or with scientists from other groups, including close collaborative research opportunities with LANL’s Ultrascale Systems Research Center (USRC), to help drive cutting edge advances. This role requires strong communication skills, as well as comprehensive troubleshooting and analytical skills.  Team member duties include: designing, building, and maintaining world-class data movement and storage systems; evaluating and testing new technology and solutions; system administration of HPC storage infrastructure in support of compute clusters; diagnosing, solving, and implementing solutions for various system operational problems; tuning file systems to increase performance and reliability of services; process automation; interacting with vendors; and communicating and collaborating with other groups, teams, projects and sites. The selected candidate will participate in a regularly scheduled rotation of on-call support of production systems, including some systems under 7x24 hour support.  In addition, some non-standard working hours may occasionally be required. This position is full-time and is located at Los Alamos National Laboratory in Los Alamos, New Mexico.   This position will be filled at either the Scientist 2 or Scientist 3 level, depending upon the skills of the selected candidate.  Additional job responsibilities (outlined below) will be assigned if the candidate is hired at the higher level. Scientist 2 ($86,000-$141,800)Participate in periodic on-call responsibilities.Work both independently and collaboratively with other members of the team or group after receiving initial direction and requirements from technical project leads.Troubleshoot, diagnose root cause of system failures, and isolate the components / failure scenarios while working with internal & external stakeholdersDevelop and publish updates on resolutions and communicate findings internally.Work with team members to make modifications and additions to existing systems, code, and methods.Work with team to bring up new hardware and test functionality.Participate in process improvement, including deep multi-system problem isolation and resolution often in collaboration with administrators of other HPC subsystems. Work with team members to document, design, and implement new ideas and approaches for newer architectures and improve those for existing ones. Present best practices, experience reports, and/or research results to managers and to peers locally or at conferences. Scientist 3 ($94,500-$157,800)In addition to the duties outlined above, a successful Scientist 3 candidate will be required to:Work as a technical leader/subject matter expert to propose and implement solutions to current problems and future deficiencies in our HPC data storage environment in conjunction with junior and senior administrators and technical staff within and across teams. Proactively create experiments and tooling to validate solutions and to detect and diagnose hardware health issues.Analyze published research papers in the area of data storage, summarize, and share implications and connections to ongoing work with team members.Interact and/or collaborate with people from other teams, groups, divisions, directorates, and programs to develop, implement, and/or communicate technical solutions.Mentor junior technical staff and students.Present best practices and research results to national peers at conferences, workshops, and meetings, as well as participate in national strategic partnerships. ", "OrganizationName": "HPC-SYS/HPC Systems Do the most meaningful work of your careerCome join the best and brightest minds in the world at one of the most innovative and creative multidisciplinary research institutions engaged in strategic science on behalf of U.S. national security.  The work that we do at Los Alamos National Laboratory (LANL) matters to our country and the world. Make a differenceAt LANL, we’re determined to harness science and imagination to make the world a better and safer place by solving complex problems others can’t.  In LANL’s High Performance Computing Division, we are pushing the computing pendulum, designing the future, and empowering scientists across the national laboratory to make an impact.  When you’re in charge of making a difference, there’s no limit to what you can do. Work/Life Balance Our diverse workforce enjoys a collegial work environment focused on creative problem solving, where everyone’s opinions and ideas are valued. We are committed to work-life balance, as well as both personal and professional growth. We consider our creative and dedicated scientific professionals to be our greatest assets, and we take pride in cultivating their talents, supporting their efforts, and enabling their successes. We provide mentoring to help new staff build a solid technical and professional foundation, and to smoothly integrate into the culture of LANL. Compensation and Benefits include:Multiple options for work schedulesExercise facility free for staff useChoice of comprehensive medical plansPaid sick time and disability insurance401k (100% match up to 6% + kicker)Fully vested in 401k on day oneRelocation Assistance (if needed)Los Alamos, New Mexico enjoys excellent weather, clean air, and outstanding public schools. This is a safe, low-crime, family-oriented community with frequent concerts and events as well as quick travel to many top ski resorts, scenic hiking & biking trails, and mountain climbing. The short drive to work includes stunning views of rugged canyons and mesas as well as the Sangre de Cristo mountains. Many employees choose to live in the nearby state capital, Santa Fe, which is known for world-class restaurants, art galleries, and opera. ", "JobTitle": "HPC Data Storage Administrator (Scientist 2/3)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1582812031&retainAM=N&addBreadCrumb=RP&p_svid=58697&p_spid=2687321&oapc=48&oas=WL7Mec8bm1B8QAXlt8T43w..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58697"}, {"WhatYouWillDo": " Manage the Energy and Utilities Management Improvement initiatives and direct engineering staff to accomplish the tasks necessary to achieve success.Assignments are wide in scope which entails project management, performing to LANL Conduct of Engineering (CoE) policies and procedures.Ensure the overall safety and security of the deployed engineering team.Timely delivery of quality products and services that meet customer requirements.Provide technical leadership and management of several teams for engineering activities performed for the Facility Operations Director (FODs).Provide technical support for utility and system engineering.Manage plant system engineers to support the utilities measures.Participate in the planning, coordination, and implementation of engineering management assessments of engineering and configuration management activities.As owner of the Building Automation Systems (BAS systems), coordinate BAS activities between re-commissioning team, operations and system engineering personnel to ensure activity outcomes leave systems functional and activities meet CoE requirements.Ensure preventive maintenance activities are defined and placed in CMMS/Passport for BAS and other systems as appropriate.Meet weekly with major customers, such as High Performance Computing (HPC), to ensure expectations are established and met.Perform DAR functions for facilities, when qualified.Assist the ES Division with audits and assessments by DOE and NNSA representatives and other external entities.", "OrganizationName": "EU-UI/Facility System Engineering Util & Infrastructure", "JobTitle": "Engineering Manager 3", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1582812031&retainAM=N&addBreadCrumb=RP&p_svid=58222&p_spid=2666297&oapc=51&oas=XQN7vA9-VWjHI-RffyP9cQ..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58222"}, {"WhatYouWillDo": "Los Alamos National Laboratory is a multidisciplinary research institution engaged in scienceand engineering on behalf of national security. The climate modeling effort at LANL, in part,develops and uses advanced multi-scale models for the study of Earth system processes. Thistwo year position is available immediately. The postdoc researcher will work in a Department of Energy (DOE) program that supportsfundamental, interdisciplinary research to achieve a predictive understanding of climate.Exploiting the capabilities of DOE’s High Performance Computing (HPC) systems in order toaccelerate advances in climate science is a priority. Sophisticated, architecture-aware, variable-resolution dynamical cores developed under thisproject permit direct numerical studies of atmospheric phenomena that are poorly resolved inthe current generation of climate models. Such processes include effects due to steeptopography, convection and cloud processes, gravity waves, frontogenesis, and others. Theresearcher will focus on investigating and characterising linkages between such processes andthe climate system. For example, the researcher will conduct variable-resolution,non-hydrostatic simulations in order to better capture precipitation distribution in developingfronts, and study the effects of such more-accurate representation of local precipitation onseasonal and regional precipitation biases---biases that plague the current generation of climatemodels.", "OrganizationName": "CCS-2/Computational Physics And Methods", "JobTitle": "Geophysical Fluid Dynamics and Atmospheric Dynamics Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1582812031&retainAM=N&addBreadCrumb=RP&p_svid=57880&p_spid=2651291&oapc=54&oas=pH-_0E5EKO4tixu7atEbMA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC57880"}, {"WhatYouWillDo": " The Deputy Group Leader (DGL) will report to the EES-16 Group Leader and will be responsible for supporting the Group Leader in scientific leadership and management, as well as operation and administration of EES-16. The EES-16 DGL, funded at 50% for management activities, will work closely with the Group Leader to advance the strategic and tactical planning of scientific programs, budgets, line management, and operations to ensure Group activities meet or exceed requirements. The successful candidate will function as a key part of the Earth and Environmental Sciences Division Leadership Team, sharing responsibility for the objectives and mission of the Division, including planning strategic directions, sound management practices, and operational excellence. The DGL will share responsibility with the Group Leader for developing and administering budgets, schedules, and performance standards for EES-16.  The DGL will help the Group Leader direct the administration of research and development employees including, forecasting staffing requirements, adhering to action-oriented programs to address affirmative action placement goals, directing assignments, assuring workforce development, monitoring performance, and initiating personnel actions. This position is funded at 50% time for the management role. The expectation is that the remaining 50% of the candidate’s time will be funded by joining existing projects or developing new projects in technical areas relevant to EES-16  where the candidate will play a technical, scientific, or project leadership role, with emphasis on developing funding for others as well.", "OrganizationName": "EES-16/Computational Earth Science", "JobTitle": "Deputy Group Leader/R&D Manager 3", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=1582812031&retainAM=N&addBreadCrumb=RP&p_svid=57401&p_spid=2629292&oapc=57&oas=oMLa_vHYe17UrNNqm4RRhw..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC57401"}], "ccs": [{"WhatYouWillDo": " The Information Sciences group (CCS‐3) of Los Alamos National Laboratory (LANL) has an opening for outstanding postdoctoral research associates in the area of combinatorial optimization. The selected candidates will be given the opportunity to work with one of the only four commercially available quantum annealing computers worldwide, D-Wave 2X, with more than 1000 qubits. Typical tasks involve formulating an NP-hard optimization problem as a quadratic unconstraint binary optimization (QUBO) problem and designing methods for improving quantum annealing scalability and accuracy.Quantum annealing is considered as one of the promising exascale and “beyond Moore’s law” computing technologies. Quantum annealers such as LANL’s D-Wave 2X are designed to natively propose solutions for optimization problems that are known to be challenging for classical computers. Preliminary knowledge about quantum physics or quantum computing is not a requirement for this position, but strong combinatorial algorithm design and implementation skills are essential.", "OrganizationName": "CCS-3/nformation Sciences", "JobTitle": "Optimization Algorithms for Post-Moore-Era Supercomputing Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=647822242&retainAM=N&addBreadCrumb=RP&p_svid=58529&p_spid=2679313&oapc=6&oas=bw4v0-TskGdOLgWByUjGtg..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58529"}, {"WhatYouWillDo": " The Plasma Physics Team with the CCS-2 group (Computational Physics and Methods Group, Computer and Computational Sciences Division) at Los Alamos National Laboratory is seeking candidates for postdoctoral positions in multi-scale modeling of dense plasmas. The successful candidate will:Work on a team to develop new computational models that span the physics of cool dense matter to hot dense matter, working as a team to incorporate results into practically useful reduced order models.Perform simulations in the cool dense matter regime using ab initio molecular dynamics (AIMD) methods connecting to kinetic theory models or fluid closures. Work at integrating models across MD, Kinetic Theory and Fluid closure models Publish in the highest-quality journals and present at national and international conferences. Be the expert on warm dense matter as part of a multidisciplinary team.Connect research directly to experiments, such as those at NIF and the Linac Coherent Light Source (LCLS) at SLAC. ", "OrganizationName": "CCS-2/Computational Physics And Methods", "JobTitle": "Multi-Scale Modeling in Warm-Dense Matter Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=647822242&retainAM=N&addBreadCrumb=RP&p_svid=58120&p_spid=2662291&oapc=9&oas=S-zhCeFucU0w7Kg52n6W2A..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC58120"}, {"WhatYouWillDo": "Los Alamos National Laboratory is a multidisciplinary research institution engaged in scienceand engineering on behalf of national security. The climate modeling effort at LANL, in part,develops and uses advanced multi-scale models for the study of Earth system processes. Thistwo year position is available immediately. The postdoc researcher will work in a Department of Energy (DOE) program that supportsfundamental, interdisciplinary research to achieve a predictive understanding of climate.Exploiting the capabilities of DOE’s High Performance Computing (HPC) systems in order toaccelerate advances in climate science is a priority. Sophisticated, architecture-aware, variable-resolution dynamical cores developed under thisproject permit direct numerical studies of atmospheric phenomena that are poorly resolved inthe current generation of climate models. Such processes include effects due to steeptopography, convection and cloud processes, gravity waves, frontogenesis, and others. Theresearcher will focus on investigating and characterising linkages between such processes andthe climate system. For example, the researcher will conduct variable-resolution,non-hydrostatic simulations in order to better capture precipitation distribution in developingfronts, and study the effects of such more-accurate representation of local precipitation onseasonal and regional precipitation biases---biases that plague the current generation of climatemodels.", "OrganizationName": "CCS-2/Computational Physics And Methods", "JobTitle": "Geophysical Fluid Dynamics and Atmospheric Dynamics Postdoc", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=647822242&retainAM=N&addBreadCrumb=RP&p_svid=57880&p_spid=2651291&oapc=12&oas=kUb--CCnpj2Mf-8wRT8CqA..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC57880"}, {"WhatYouWillDo": " The Applied Computer Science group (CCS-7) is the Laboratory’s vanguard research organization for scientific applications at extreme scale. The four focus areas of the group are (1) applications, algorithms, and hardware co-design; (2) performance optimization and transition of scientific applications to future architectures; (3) programming models, runtime systems and tools; and (4) data science and visualization at scale. Projects typically involve collaborations inside and outside of the Laboratory, in line with the group’s commitment to engage with theoretical, experimental, and computer-systems scientists to develop integrated, cross-disciplinary solutions to challenges posed by next-generation extreme-scale computing. Billion-way parallelism, deep memory and storage hierarchies, and heterogeneous computing are forcing us to rethink how we enable applications at extreme scale and we are one of the few groups in the world focusing on solutions to these issues. CCS-7 invites programmers to apply for a position of Scientist 2/3 in our group and strengthen our efforts to provide assistance to science application code teams that are preparing for emerging high-performance system architectures. The successful candidate is expected to be a self-starter, taking initial direction and requirements from technical project leads, and to work as part of a collaborative, multidisciplinary team to support the science applications in the high performance computing community.   We are looking for candidates with either a computer science background and a computational science interest, or a computational science background with an interest of computer science.  The ideal candidate will have a demonstrated track record of contributions to large project.  In addition, demonstrated programming-for-fun through contributions to open source projects or other projects away from work is highly valued.  Knowledge of parallel programming either through GPU programming (CUDA/OpenCL/etc.), threads (OpenMP/Posix/etc.), or MPI is required. This position will be filled at either the Scientist 2/3 level, depending on the skills of the selected candidate.  Additional job responsibilities (outlined below) will be assigned if the candidate is hired at the higher level. Scientist 2 ($86,000-$141,800)The successful candidate will be required to:Design and implement interfaces for separating the physics from the underlying hardware using industry standard software engineering practices Work both independently and collaboratively with other members of the team after receiving initial direction and requirements from technical project leadsDeliver based on provided direction, for example, provide reference implementations for techniques described in a research paper or a technical report, or improve the efficiency / performance of a section of code within a larger applicationConduct a literature search to find prior research related to an idea Work with team members to make modifications and additions to existing code and methodsWork with team members to document, design and implement new ideas and approaches for newer architectures and improve those for existing onesScientist 3 ($94,500-$157,800)In addition to the duties of a Scientist 2, the successful candidate will be required to:Contribute to proposals for research and implementation of new methods, frameworks and programming models in support of scientific application developmentInteract with people from other teams, groups, divisions, directorates, and programs to create collaborationsWork with limited direction, for example, execute work based on a fragment of an idea or a half-formed idea and carry it to completionMentor junior scientists and studentsPresent the results of research at conferences, workshops, and meetings Represent LANL and the DOE at workshops and meetings", "OrganizationName": "CCS-7/Applied Computer Science", "JobTitle": "Applied Computer Science Group Programmers (Scientist 2/3)", "Site": "https://jobszp1.lanl.gov/OA_HTML/OA.jsp?page=/oracle/apps/irc/candidateSelfService/webui/VisVacDispPG&OAHP=IRC_EXT_SITE_VISITOR_APPL&OASF=IRC_VIS_VAC_DISPLAY&akRegionApplicationId=821&transactionid=647822242&retainAM=N&addBreadCrumb=RP&p_svid=53598&p_spid=2424287&oapc=15&oas=LpWs2pfy4OydS3Sn4J_T3Q..", "Location": "Los Alamos, NM, US", "VacancyNumber": "IRC53598"}]}}